{
    "fireeye-1": {
        "doc": "Chinese cyber espionage operators modified the software packages of a legitimate vendor, NetSarang Computer, allowing access to a broad range of industries and institutions that include financial services, transportation, telecommunications, energy, media, academic, retail, and gaming. The malicious actors embedded a backdoor named SHADOWPAD, which can access network data and download additional malware. Based on shared communications infrastructure and similar targeting and tactics, FireEye Threat Intelligence assesses this activity is related to a Chinese espionage team that previously targeted a gaming company in 2015.",
        "roles": {
            "adversary": [
                [
                    "Chinese cyber espionage operators",
                    "malicious actors",
                    "Chinese espionage team"
                ]
            ],
            "capability": [
                [
                    "backdoor",
                    "SHADOWPAD"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "legitimate vendor,",
                    "NetSarang Computer"
                ],
                [
                    "financial services"
                ],
                [
                    "gaming company in 2015"
                ]
            ]
        }
    },
    "fireeye-2": {
        "doc": "GREF Team is an innovative China-nexus cyber espionage operator that focuses on targeting energy, video game development studios, and high-tech companies in the U.S., South Korea, the Netherlands, Italy, France, and Japan. The group leverages a large library of malware tools, compromised digital certificates, and exploits. Besides being linked to a common supplier shared with other Chinese cyber espionage groups, GREF Team is believed to distribute its tools to other distinct China-based actors.",
        "roles": {
            "adversary": [
                [
                    "Chinese cyber espionage groups,",
                    "other distinct China-based actors"
                ],
                [
                    "GREF Team",
                    "GREF Team"
                ]
            ],
            "capability": [
                [
                    "malware tools",
                    "tools"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-3": {
        "doc": "FireEye Threat Intelligence uncovered GREF Team reusing a sender address from 2016 to target a European cryptocurrency exchange. GREF Team leveraged .NET malware that beacons to an IP address belonging to a South Korean University. This is the first time FireEye Threat Intelligence has uncovered GREF Team targeting financial entities, but it is consistent with our assessment that the team is involved in both financially motivated activity and cyber espionage on behalf of Chinese government interests.",
        "roles": {
            "adversary": [
                [
                    "GREF Team reusing",
                    "GREF Team leveraged",
                    "GREF Team",
                    "the team"
                ]
            ],
            "capability": [
                [
                    ".NET malware"
                ]
            ],
            "infrastructure": [
                [
                    "IP address"
                ]
            ],
            "victim": [
                [
                    "South Korean University"
                ],
                [
                    "European cryptocurrency exchange"
                ]
            ]
        }
    },
    "fireeye-4": {
        "doc": "FireEye Threat Intelligence analyzed data sourced from a command and control (C&amp;C) server running an application named \"Werka,\" which is used by TrickBot for dynamic webinject administration and delivery. The Werka server delivers unique web injection code based on the presence of different gtags, or campaign identifiers, within requests made to the server. The manner in which this system operates suggests that each gtag value is associated with a different TrickBot customer. FireEye Threat Intelligence has identified and clustered a number of TrickBot gtag values found in the configuration of this system and has further found evidence to suggest that some associated TrickBot customers may be actively using other banking malware families, including Corebot, Danabot, Emotet, Gootkit, IcedID, Nymaim, TinyNuke, Ursnif, and Zeus Panda.",
        "roles": {
            "adversary": [
                [
                    "TrickBot customer",
                    "TrickBot customers"
                ]
            ],
            "capability": [
                [
                    "command and control (C&amp;C) server"
                ],
                [
                    "web injection code"
                ],
                [
                    "Danabot"
                ],
                [
                    "IcedID"
                ],
                [
                    "Zeus Panda"
                ],
                [
                    "\"Werka,\"",
                    "TrickBot",
                    "Werka server",
                    "this system",
                    "TrickBot",
                    "TrickBot",
                    "this system",
                    "TrickBot"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-5": {
        "doc": "FireEye Threat Intelligence discovered dozens of irregularities in the domain resolutions of government and commercial websites in the Middle East, North Africa, and Europe. Since 2017, DNS records were altered, and fraudulent Secure Sockets Layer (SSL) certificates were created for more than 100 domains in order to redirect and intercept website traffic and steal valid credentials and emails. FireEye Threat Intelligence has been unable to attribute these unauthorized changes to a tracked group; however, the targeting and limited technical evidence are consistent with Iranian actors. It is also likely that more than one actor has used this technique.",
        "roles": {
            "adversary": [
                [
                    "Iranian actors"
                ]
            ],
            "capability": [
                [
                    "fraudulent Secure Sockets Layer (SSL) certificates"
                ]
            ],
            "infrastructure": [
                [
                    "DNS records"
                ],
                [
                    "website"
                ],
                [
                    "valid credentials and emails"
                ]
            ],
            "victim": []
        }
    },
    "fireeye-6": {
        "doc": "FireEye Threat Intelligence has observed evidence of an actor(s) leveraging GitHub to host a variety of malware for campaigns that appear to be targeting entities in Russia for financial gain. Despite recent reporting indicating that these campaigns are distributing Buhtrap, we have not observed direct evidence of Buhtrap payloads being delivered in these operations. We anticipate that this actor(s) will continue conducting operations for at least the near term. However, due to the variety of different malware families these operations have employed, it is possible that this actor(s) will adopt additional malware variants in future operations.",
        "roles": {
            "adversary": [
                [
                    "actor(s)",
                    "actor(s)",
                    "actor(s)"
                ]
            ],
            "capability": [
                [
                    "Buhtrap",
                    "Buhtrap payloads"
                ]
            ],
            "infrastructure": [
                [
                    "GitHub"
                ]
            ],
            "victim": [
                [
                    "entities in Russia"
                ]
            ]
        }
    },
    "fireeye-7": {
        "doc": "FireEye Threat Intelligence developed an Operational Technology Cyber Security Incident Ontology (OT-CSIO) to classify different types of attacks, facilitate cross-case analysis, and provide guidance for assessing risks. It consists of high-level analysis and is not meant to provide in-depth insights into the nuances of each incident. Our methodology evaluates four categories, which are target, sophistication, impact, and affected equipment architecture based on the Purdue Model (18-00020979). The OT-CSIO evaluates the full attack lifecycle and does not describe the tactics, techniques, and procedures (TTPs) implemented at each step of the incident.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-8": {
        "doc": "Continued examination revealed multiple distinct clusters within the previously reported DNS manipulation activity. Cluster A uses phishing and TWOTONE malware, and Cluster B appears to use web exploits and penetration testing frameworks to gain initial access to victim networks. Actors responsible for Cluster B interrupted operations after an emergency directive was published by the U.S. Department of Homeland Security (DHS) on Jan. 22, 2019, but we cannot definitively say that this publication caused the change in operations. However, FireEye Threat Intelligence discovered Cluster B victims leveraging new infrastructure since then.",
        "roles": {
            "adversary": [
                [
                    "Actors"
                ]
            ],
            "capability": [
                [
                    "DNS manipulation"
                ],
                [
                    "phishing"
                ],
                [
                    "TWOTONE malware"
                ]
            ],
            "infrastructure": [
                [
                    "victim networks"
                ]
            ],
            "victim": []
        }
    },
    "fireeye-9": {
        "doc": "FireEye devices detected and blocked a likely Iranian group using a compromised email account to target a Lebanese insurance company using TWOTONE malware and newly registered command and control (C&amp;C) infrastructure. The compromised email account belongs to a Lebanese insurance company which experienced DNS hijacking activity Nov. 28, 2018. FireEye Threat Intelligence found a related phishing document impersonating a UK university and domains spoofing an Indian outsourcing firm.",
        "roles": {
            "adversary": [
                [
                    "Iranian group"
                ]
            ],
            "capability": [
                [
                    "TWOTONE malware"
                ],
                [
                    "command and control (C&amp;C) infrastructure"
                ],
                [
                    "phishing document"
                ],
                [
                    "domains spoofing"
                ],
                [
                    "compromised email account",
                    "compromised email account"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "UK university"
                ],
                [
                    "Indian outsourcing firm"
                ],
                [
                    "Lebanese insurance company",
                    "Lebanese insurance company"
                ]
            ]
        }
    },
    "fireeye-10": {
        "doc": "In late March 2019, FireEye Threat Intelligence observed UPS- and invoice-themed campaigns delivering Emotet via links leading to ZIP archives containing macro-laden Word documents or JavaScript. This is a departure from its historical tactics, techniques, and procedures (TTPs); most commonly, campaigns have leveraged macro document attachments or links leading to macro documents. FireEye Threat Intelligence also observed changes in the way Emotet communicates through HTTP POST requests with its command and control (C&amp;C) servers. These changes were likely made to evade host and network-based detection mechanisms, although it would be easy for security product vendors to adapt to these changes.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "macro-laden Word documents or JavaScript",
                    "macro document attachments",
                    "macro documents"
                ],
                [
                    "command and control (C&amp;C) servers"
                ],
                [
                    "Emotet"
                ],
                [
                    "UPS-"
                ]
            ],
            "infrastructure": [
                [
                    "HTTP POST requests"
                ]
            ],
            "victim": []
        }
    },
    "fireeye-11": {
        "doc": "A supply chain compromise first reported in March 2019 distributed CRACKSHOT and DEADEYE downloaders primarily to victims in Southeast Asia. We surmise the incident is linked to similar previously reported supply chain compromises affecting entities in East Asia, although the tactics, techniques, and procedures (TTPs) demonstrate a greater effort to evade detection and hinder analysis when compared to the older campaigns.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "CRACKSHOT"
                ],
                [
                    "DEADEYE"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "entities in East Asia"
                ]
            ]
        }
    },
    "fireeye-12": {
        "doc": "FireEye Threat Intelligence has been tracking a fast-flux bulletproof hosting infrastructure internally named \"Fluxxy\" (aka DarkCloud) that has been active since at least late 2009.The actor(s) associated with the bulletproof hosting service use the moniker \"Ccweb\" and have advertised the bulletproof hosting service on exploit.in since 2010, with the notable addition of fast-flux in 2012. The actor \"Sollhost\" is believed to be a verified reseller of Fluxxy offering the service under the name of \"Sollhost bulletproof hosting.\" FireEye Threat Intelligence has observed significant interest in Fluxxy by a large number of actors. The related infrastructure has been leveraged for various types of malicious activity, including numerous malware operations, phishing sites, and card shops; we assess with high confidence that actors will continue using this service.",
        "roles": {
            "adversary": [
                [
                    "actor(s)",
                    "\"Ccweb\""
                ],
                [
                    "The actor \"Sollhost\"",
                    "Sollhost"
                ],
                [
                    "a large number of actors",
                    "actors"
                ]
            ],
            "capability": [
                [
                    "fast-flux bulletproof hosting infrastructure internally",
                    "Fluxxy",
                    "DarkCloud",
                    "the bulletproof hosting service",
                    "Fluxxy",
                    "Fluxxy"
                ],
                [
                    "malware"
                ],
                [
                    "phishing sites"
                ],
                [
                    "card shops"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-13": {
        "doc": "FireEye Threat Intelligence identified a cluster of activity that began in April 2019 and continued through June 2019 that leveraged web-based attacks including the SharePoint vulnerability CVE-2019-0604 to target financial institutions in Turkey and Southeast Asia. Based on overlaps in infrastructure and targeting, we assess with low confidence this campaign is affiliated with TEMP.Shadow (aka EmpireMonkey) and is likely financially motivated. We anticipate the actors responsible for this operation will continue targeting financial institutions for the foreseeable future; however, the actors may shift at least some tactics, techniques, and procedures (TTPs) in future operations.",
        "roles": {
            "adversary": [
                [
                    "the actors responsible for this operation",
                    "the actors"
                ]
            ],
            "capability": [
                [
                    "web-based attacks",
                    "SharePoint vulnerability CVE-2019-0604"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "financial institutions in Turkey and Southeast Asia"
                ],
                [
                    "TEMP.Shadow",
                    "EmpireMonkey"
                ],
                [
                    "financial institutions"
                ]
            ]
        }
    },
    "fireeye-15": {
        "doc": "Since June 7, 2019, FireEye Threat Intelligence has observed a complete cessation of Emotet-related spam distribution activity. The inactivity of Emotet distribution operations is supported by evidence observed across the FireEye sensor network and active monitoring of the Emotet botnet. The cause for this current cessation of activity is unclear, and it is not known whether this period of inactivity will lead to a permanent change in Emotet operations, though we continue to proactively monitor the situation.",
        "roles": {
            "adversary": [
                [
                    "Emotet distribution operations"
                ]
            ],
            "capability": [
                [
                    "Emotet",
                    "Emotet",
                    "Emotet botnet",
                    "Emotet"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-17": {
        "doc": "On May 14, 2019, FireEye devices detected spear-phishing emails attempting to direct victims to Dropbox folders to deliver the TAILCOAT payload. The emails were sent to employees at several European missions to Palestine and related diplomatic entities in the region and leveraged Palestinian-themed lure content. While attribution is unclear, tactics, techniques, and procedures (TTPs) and targeting is consistent with previously reported Molerats Team activity.",
        "roles": {
            "adversary": [
                [
                    "Molerats Team"
                ]
            ],
            "capability": [
                [
                    "spear-phishing emails",
                    "emails"
                ],
                [
                    "TAILCOAT payload"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "employees at several European missions to Palestine",
                    "related diplomatic entities in the region"
                ]
            ]
        }
    },
    "fireeye-18": {
        "doc": "On July 11, 2019, the Security Service of Ukraine announced the arrest of Mykhailo Rytikov, who they allege has operated a bulletproof hosting service since at least 2007 using the monikers \"Whost,\" \"Webhost,\" and \"абдула,\" among others. FireEye Threat Intelligence observed actors complain that their servers were offline on the date of the arrest, and other actors began questioning whether the Whost username had been taken over by law enforcement. However, forum administrators have since verified the moniker's legitimacy, suggesting that at least some individuals behind the Whost service may be continuing to operate. While the arrest of Rytikov may cause a temporary cessation in some malicious activity using Whost, it is unlikely to have a significant impact long-term as actors can easily shift to alternative hosting providers to support their operations.",
        "roles": {
            "adversary": [
                [
                    "Mykhailo Rytikov",
                    "Rytikov"
                ],
                [
                    "Whost",
                    "Webhost",
                    "абдула",
                    "Whost",
                    "Whost"
                ]
            ],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-19": {
        "doc": "&nbsp;In June 2019, the National Institute of Standards and Technology (NIST) released a special publication draft that expands the cyber security requirements imposed on certain U.S. Department of Defense (DoD) contractors. The publication includes an explicit requirement to either segment operational technology (OT) or ensure the devices are compliant with imposed cyber security requirements. The inclusion of OT-specific requirements in an information technology (IT)-dominate cyber security standard demonstrates the pertinence of OT and an increased level of awareness by cyber security regulators. We also stress that segmentation is a necessary yet insufficient step toward securing OT networks.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-20": {
        "doc": "FireEye Threat Intelligence assesses with moderate confidence that a suspected fabricated letter advocating for the overthrow of the Russian Government, purportedly authored by U.S. Senator Ben Cardin, is being leveraged as part of a broader pro-Russia information operation primarily being run across various Russian and Ukrainian blogs and online forums. While the vast majority of the identified activity is being conducted on forums and blog sites, we have also observed a Reddit account and a small number of suspected inauthentic Facebook accounts promote the activity. The FireEye Threat Intelligence investigation, which has thus far identified activity occurring as recently as July 2, 2019, adds to findings by the Atlantic Council's Digital Forensic Research Lab (DFRLab) published in June 2019, which exposed similar activity occurring in 2018 and early 2019. We assess with high confidence that the broader operation frequently leverages forged correspondence between high-level government officials.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-21": {
        "doc": "On July 12, 2019, FireEye Threat Intelligence identified a phishing campaign that delivered the COOLPANTS backdoor using financial transaction-themed lures. The emails in this campaign included indicators and targeting typical of past suspected TEMP.Splinter campaigns and delivered a COOLPANTS payload that used command and control (C&amp;C) infrastructure overlapping with a past suspected TEMP.MetaStrike campaign. While COOLPANTS is believed to be private to TEMP.MetaStrike, this malware has been delivered in multiple previous campaigns that exhibit delivery methods and targeting characteristic of TEMP.Splinter. Plausible scenarios that may explain this include TEMP.Splinter acting as a delivery service, all observed activity being carried out by TEMP.MetaStrike, or intermittent cooperation between the two groups.",
        "roles": {
            "adversary": [
                [
                    "TEMP.MetaStrike",
                    "TEMP.MetaStrike",
                    "TEMP.MetaStrike"
                ],
                [
                    "TEMP.Splinter",
                    "TEMP.Splinter",
                    "TEMP.Splinter"
                ]
            ],
            "capability": [
                [
                    "COOLPANTS backdoor",
                    "COOLPANTS payload",
                    "COOLPANTS",
                    "malware"
                ],
                [
                    "command and control (C&amp;C) infrastructure"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-22": {
        "doc": "In May 2019, FireEye devices detected and blocked a spear-phishing campaign likely targeting Ukrainian government entities distributing the ARMEDCLOUD malware attributed to TEMP.Armageddon. Additional samples and related infrastructure were subsequently uncovered. This newest version of ARMEDCLOUD contains anti-forensic features.",
        "roles": {
            "adversary": [
                [
                    "TEMP.Armageddon"
                ]
            ],
            "capability": [
                [
                    "spear-phishing"
                ],
                [
                    "ARMEDCLOUD malware",
                    "ARMEDCLOUD"
                ],
                [
                    "anti-forensic features"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "Ukrainian government entities"
                ]
            ]
        }
    },
    "fireeye-23": {
        "doc": "After a brief cessation of Qakbot activity in early July 2019, FireEye Threat Intelligence observed Qakbot activity resume on July 16 and incorporate an updated version of the password grabber module. The latest version of the password grabber module includes debug strings that reveal names of internal functions and the name of the module itself (plugin_passgrabber).One of the most notable aspects of the update is the inclusion of two embedded URLs that were seen leading to the download of a version of Mimikatz that appears to be unique to Qakbot.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "Qakbot",
                    "Qakbot",
                    "debug strings",
                    "Qakbot"
                ],
                [
                    "password grabber module"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-24": {
        "doc": "Beginning on July 18, 2019, FireEye Threat Intelligence observed Amadey campaigns that closely resembled previous Chanitor campaigns and delivered Cobalt Strike Beacon, Pony, SendSafe, and Ursnif. Based on multiple overlaps in the tactics, techniques, and procedures (TTPs) used throughout these campaigns, we have high confidence that at least one of the actors associated with the Chanitor distribution network has begun using AMADEY malware in campaigns as a replacement for Chanitor. While these campaigns appear to be related to prior Chanitor campaigns, there were notable difference beyond its replacement with AMADEY that suggest the actors behind this operation are experimenting with new TTPs.",
        "roles": {
            "adversary": [
                [
                    "actors",
                    "actors"
                ]
            ],
            "capability": [
                [
                    "Amadey",
                    "AMADEY malware",
                    "AMADEY"
                ],
                [
                    "Cobalt"
                ],
                [
                    "Pony"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-26": {
        "doc": "While overlaps exist in the tools and methodologies used to perform reconnaissance in information technology (IT) and operational technology (OT) environments, the information required for a targeted attack on OT systems is unique. Organizations should identify their unique attack surfaces, the value of their OT information to the adversary, and how the information can be used in the context of a tailored attack. Controlling and protecting this information should be a priority for denying adversary reconnaissance efforts.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "information technology (IT) and operational technology (OT) environments",
                    "OT systems",
                    "OT information"
                ]
            ],
            "victim": []
        }
    },
    "fireeye-27": {
        "doc": "In late July 2019, FireEye Threat Intelligence observed a campaign using various delivery mechanisms to deliver KAYSLICE and COOLPANTS. Observed recipients included individuals at financial organizations based in Russia and Slovakia. Based on the use of overlapping tactics, techniques, and procedures (TTPs), we assess with moderate confidence that the recent KAYSLICE/COOLPANTS campaign can be attributed to TEMP.MetaStrike (aka Cobalt Group).",
        "roles": {
            "adversary": [
                [
                    "TEMP.MetaStrike",
                    "Cobalt Group"
                ]
            ],
            "capability": [
                [
                    "KAYSLICE and",
                    "COOLPANTS.",
                    "KAYSLICE/COOLPANTS"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "individuals at financial organizations based in Russia and Slovakia"
                ]
            ]
        }
    },
    "fireeye-28": {
        "doc": "On July 25, 2019, City Power Johannesburg announced that their information technology (IT) systems were infected with a ransomware virus that encrypted their \"databases, applications and networks. \" The attack on Johannesburg-based City Power prevented customers on pay-as-you-go plans from purchasing electricity. FireEye Threat Intelligence has recently observed various cases of ransomware infections on IT systems resulting in disruptions or outages to production despite no impact to operational technology (OT) networks (19-00012368). City Power's incident is the first instance we have observed where customers lost access to energy as a result of malware infections in corporate networks. We suggest that organizations with high-availability requirements evaluate their safety and business risks related to ransomware attacks.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "ransomware virus",
                    "ransomware infections",
                    "malware infections",
                    "ransomware attacks"
                ]
            ],
            "infrastructure": [
                [
                    "information technology (IT) systems",
                    "databases, applications and networks",
                    "IT systems",
                    "corporate networks"
                ]
            ],
            "victim": [
                [
                    "City Power Johannesburg",
                    "Johannesburg-based City Power",
                    "City Power's"
                ]
            ]
        }
    },
    "fireeye-29": {
        "doc": "Security researchers identified 11 vulnerabilities in the VxWorks real-time operating system (RTOS) developed by Wind River. The collection of vulnerabilities is dubbed \"Urgent/11.\" RTOS have specialized kernels that minimize interruptions to critical system processes. VxWorks is the most common RTOS and can be found in embedded systems used in a wide variety of industries, including aerospace and defense, automotive, consumer electronics, industrial automation, medical devices, and network/computer infrastructure. Asset owners are encouraged to apply the latest patches released by Wind River. Alternative mitigations, such as firewall rules, intrusion detection signatures, or OS-version upgrades, can be deployed as countermeasures in the absence of patches.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "11 vulnerabilities",
                    "\"Urgent/11.\""
                ]
            ],
            "infrastructure": [
                [
                    "critical system processes",
                    "embedded systems"
                ],
                [
                    "VxWorks real-time operating system (RTOS)",
                    "RTOS",
                    "VxWorks is",
                    "RTOS"
                ]
            ],
            "victim": []
        }
    },
    "fireeye-30": {
        "doc": "On July 29, 2019, Capital One announced a data security incident in which an unauthorized actor accessed personal information of over 100 million individuals in the United States and approximately 6 million in Canada who applied for Capital One credit card products between 2005 and early 2019. Paige Adele Thompson, who was arrested in Washington state in association with the breach, exploited a firewall misconfiguration that allowed her to gain access to folders or buckets of data in Capital One's cloud storage space. Currently, the motivation for the attack is uncertain, but the brazenness with which she discussed her activities may suggest that she was at least in part motivated by ego or other factors. The vast amount of data stored in the cloud from many different sources makes systems and data hosted by cloud services providers attractive targets, and we anticipate actors will continue targeting and abusing cloud services for the foreseeable future.",
        "roles": {
            "adversary": [
                [
                    "unauthorized actor",
                    "Paige Adele Thompson",
                    "her",
                    "she",
                    "her",
                    "she"
                ]
            ],
            "capability": [],
            "infrastructure": [
                [
                    "Capital One credit card products"
                ],
                [
                    "firewall misconfiguration"
                ],
                [
                    "cloud storage space"
                ]
            ],
            "victim": [
                [
                    "100 million individuals in the United States"
                ],
                [
                    "6 million in Canada"
                ],
                [
                    "Capital One",
                    "Capital One",
                    "Capital One"
                ]
            ]
        }
    },
    "fireeye-31": {
        "doc": "FireEye devices blocked the attempted download of a SOGU payload at a Hong Kong-based media organization. Based on infrastructure overlap and similarities in tactics, techniques, and procedures (TTPs), we believe this activity is likely related to previous Chinese espionage operations leveraging SOGU and HIGHNOON malware. We note that this activity will likely continue in the short to medium term and that media and civil society organizations in the region remain at risk of targeting with SOGU malware.",
        "roles": {
            "adversary": [
                [
                    "Chinese espionage"
                ]
            ],
            "capability": [
                [
                    "HIGHNOON malware"
                ],
                [
                    "SOGU payload",
                    "SOGU",
                    "SOGU malware."
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "Hong Kong-based media organization"
                ],
                [
                    "media and civil society organizations in the region"
                ]
            ]
        }
    },
    "fireeye-32": {
        "doc": "In April 2019, FireEye Threat Intelligence reported on a network of suspected inauthentic news sites and social media accounts, aimed at audiences globally, conducting influence activity supportive of the United Arab Emirates (UAE) and critical of its regional rivals, Qatar and Iran. We surmised that the network was being operated by a marketing firm in India on behalf of actors seeking to support UAE political interests. We have continued to identify additional activity that we believe is being conducted by this network, including the leveraging of personas on additional social media platforms to promote political narratives. The personas have promoted narratives, specific to their regions of focus, that reflect UAE political interests. For example, we observed accounts posing as individuals from Turkey promote messaging critical of the Turkish Justice and Development (AKP) party and supportive of Ekrem İmamoğlu, the then-opposition candidate for Istanbul mayor, ahead of the Istanbul mayoral elections that occurred on June 23.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-33": {
        "doc": "FireEye Threat Intelligence uncovered a malicious profiling script on the website of an Armenian think tank in June 2019. The website redirects to a second compromised domain hosting a WITCHCOVEN profiling script. WITCHCOVEN has been used by Russia-nexus Turla since 2014 to collect detailed web browser information and install a persistent tracking cookie. The compromised domain also hosted a sample of the new WHIPSNAP backdoor.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "malicious profiling script",
                    "WITCHCOVEN profiling script",
                    "WITCHCOVEN"
                ],
                [
                    "persistent tracking cookie"
                ],
                [
                    "WHIPSNAP backdoor"
                ]
            ],
            "infrastructure": [
                [
                    "website",
                    "website",
                    "compromised domain"
                ]
            ],
            "victim": [
                [
                    "Armenian think tank"
                ]
            ]
        }
    },
    "fireeye-34": {
        "doc": "FireEye technical analysts examined two APT32 archives leveraging Singapore conference-themed filenames and decoy documents to target unknown victims. At least one sample was hosted on Dropbox and likely delivered through a malicious link embedded in a phishing email. Following victim initialization of the executable contained in the archive, the infection process leads to installation of a FREIGHTBOX dropper and a BEACON payload.",
        "roles": {
            "adversary": [
                [
                    "APT32"
                ]
            ],
            "capability": [
                [
                    "phishing email"
                ],
                [
                    "FREIGHTBOX dropper"
                ],
                [
                    "BEACON payload"
                ]
            ],
            "infrastructure": [
                [
                    "Dropbox"
                ]
            ],
            "victim": []
        }
    },
    "fireeye-36": {
        "doc": "FireEye Threat Intelligence analyzed a malicious macro document targeting a U.S.-based water and power utility company in late July 2019. The unknown threat actor leveraged skilled social engineering techniques and LOOKBACK malware. The macro document bears superficial similarities to public FireEye Threat Intelligence reporting on UPPERCUT activity. Entities in the utilities sector are likely at risk of targeting in the short- to medium-term and should remain vigilant.",
        "roles": {
            "adversary": [
                [
                    "The unknown threat actor"
                ]
            ],
            "capability": [
                [
                    "social engineering"
                ],
                [
                    "LOOKBACK malware"
                ],
                [
                    "malicious macro document",
                    "macro document"
                ],
                [
                    "UPPERCUT"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "Entities in the utilities sector"
                ],
                [
                    "U.S.-based water and power utility company"
                ]
            ]
        }
    },
    "fireeye-37": {
        "doc": "A newly identified downloader, referred to by FireEye Threat Intelligence as BULLZLINK, demonstrates a number of overlaps with malware developed and offered by badbullzvenom. During July 2019, two campaigns were identified using this downloader, including a NETWIRE campaign attributed to TEMP.Splinter and a likely SQUIDSLEEP/SQUIDGATE campaign that has not yet been attributed to a specific threat actor group. Based upon these observations, we assess with moderate confidence that badbullzvenom is continuing to develop new tools for use by financially motivated threat actors.",
        "roles": {
            "adversary": [
                [
                    "TEMP.Splinter"
                ],
                [
                    "actor"
                ]
            ],
            "capability": [
                [
                    "NETWIRE"
                ],
                [
                    "SQUIDSLEEP/SQUIDGATE"
                ],
                [
                    "newly identified downloader",
                    "BULLZLINK",
                    "this downloader"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-38": {
        "doc": "In August 2019, FireEye Threat Intelligence identified campaigns leveraging a modified version of SmokeLoader that bypasses the normal SmokeLoader pay-per-update business model. This modified version of the malware has been patched by editing existing binaries to communicate with updated command and control (C&amp;C) URLs. While we have not yet observed any actors publicly advertising this modified version of SmokeLoader for sale, it is plausible that actors could sell this version of the malware for significantly less than the original version of SmokeLoader.",
        "roles": {
            "adversary": [
                [
                    "actors"
                ]
            ],
            "capability": [
                [
                    "command and control (C&amp;C) URLs"
                ],
                [
                    "normal SmokeLoader",
                    "original version of SmokeLoader"
                ],
                [
                    "modified version of SmokeLoader",
                    "modified version of the malware",
                    "modified version of SmokeLoader"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-39": {
        "doc": "During a compromise of a hospitality organization, which we attribute to FIN7, the attackers deployed various malicious payloads, including CARBANAK, BABYMETAL, and the PILLOWMINT point-of-sale (POS) malware. Notably, in this incident, FIN7 leveraged a seemingly compromised email account belonging one of the victim's suppliers to send a password-protected GRIFFON document to a restaurant manager. FIN7's shift to engaging in third-party compromise attacks marks a significant evolution in the group's operations and the manner in which organizations need to protect themselves against their attacks.",
        "roles": {
            "adversary": [
                [
                    "FIN7",
                    "FIN7",
                    "FIN7",
                    "the group's"
                ]
            ],
            "capability": [
                [
                    "malicious payloads"
                ],
                [
                    "CARBANAK"
                ],
                [
                    "BABYMETAL"
                ],
                [
                    "PILLOWMINT point-of-sale (POS) malware"
                ]
            ],
            "infrastructure": [
                [
                    "email account"
                ],
                [
                    "password-protected GRIFFON document"
                ]
            ],
            "victim": [
                [
                    "victim",
                    "restaurant manager"
                ]
            ]
        }
    },
    "fireeye-40": {
        "doc": "Since the December 2018 indictment of multiple APT10 actors, monitoring of numerous attack surfaces, sensitive-source feeds, public repositories, and open-source reporting has not resulted in the detection of new APT10 activity. Based on prior operational characteristics, we continue to assess with low confidence that the group has reduced operational visibility and will return after a period of dormancy. However, the actors themselves may have been reassigned or relieved from their contracts. Operators previously associated with APT10 may have returned as part of different APT missions working on behalf of the People's Republic of China Ministry of State Security (MSS). APT10 was known for having shifted over to publicly available tools and either using them as-is or only slightly modifying them. Their last activity before the indictment was largely QUASSARRAT, BEACON, and UPPERCUT. Previously, each time that APT10 has reemerged after a lull, the group has largely shifted over to new sets of public or shared tools.",
        "roles": {
            "adversary": [
                [
                    "People's Republic of China Ministry of State Security (MSS)"
                ],
                [
                    "APT10 actors",
                    "APT10 activity",
                    "the group has",
                    "APT10 may",
                    "APT10 was",
                    "APT10 has",
                    "the group"
                ]
            ],
            "capability": [
                [
                    "QUASSARRAT"
                ],
                [
                    "BEACON"
                ],
                [
                    "UPPERCUT"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-41": {
        "doc": "On Aug. 5, 2019, Twitter account @BelangerPolice, an account posing as a Toronto police inspector, posted tweets alleging that U.S. National Security Advisor John Bolton was involved with money laundering through transactions involving the Iranian opposition group People's Mojahedin Organization of Iran (MEK). Toronto Police confirmed that the account, now suspended, was inauthentic. While we are currently unable to provide attribution for the @BelangerPolice account, its activity and promoted narratives are consistent with what we have observed from pro-Iran information operations. We identified a Twitter account posing as a \"freelance journalist\" that we surmise was created to promote the Belanger content, along with other material pertaining to John Bolton. We identified a second Twitter account posing as a \"freelance journalist\" replying to a @BelangerPolice tweet that we surmise is an inauthentic persona. However, we do not have attribution or motive for this account at this time.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-42": {
        "doc": "South Asian government entities were targeted with BREEZESUGAR malware in a spear-phishing campaign on June 12, 2019.Although attribution is unclear, we have previously seen similar activity in campaigns leveraging EVILNUGGET, which we believe is used by Chinese actors. Governments and military entities in South Asia remain at risk of targeting by this actor and BREEZESUGAR malware. &nbsp;",
        "roles": {
            "adversary": [
                [
                    "Chinese actors"
                ],
                [
                    "actor"
                ]
            ],
            "capability": [
                [
                    "spear-phishing campaign"
                ],
                [
                    "EVILNUGGET"
                ],
                [
                    "BREEZESUGAR malware",
                    "BREEZESUGAR malware"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "South Asian government entities"
                ],
                [
                    "Governments and military entities in South Asia"
                ]
            ]
        }
    },
    "fireeye-43": {
        "doc": "In August 2019, FireEye Threat Intelligence identified a campaign in which malicious actors targeted customers of two Mexican banks with a customized variant of the KL Remota banking malware. Based on overlaps in the attacker infrastructure, we assess with high confidence that this recent campaign was conducted by a Mexican threat actor who has been active for more than four years. There are multiple indications that Brazilian malware developer(s) provided the Mexican threat actor with a customized variant of the KL Remota for use in operations targeting Mexican financial institutions. The relationship highlights Brazilian malware developers' interest in broadening the scope of their operations and their willingness to engage actors or groups from other countries for monetary gains.",
        "roles": {
            "adversary": [
                [
                    "malicious actors",
                    "Mexican threat actor",
                    "Mexican threat actor"
                ],
                [
                    "Brazilian malware developer(s)",
                    "Brazilian malware developers'"
                ]
            ],
            "capability": [
                [
                    "KL Remota banking malware",
                    "KL Remota"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "Mexican financial institutions"
                ]
            ]
        }
    },
    "fireeye-44": {
        "doc": "FireEye Threat Intelligence recently observed a malicious email campaign targeting multiple organizations across North America and Europe and delivering FLAWEDAMMYYY payloads. This activity has overlaps with a financially motivated actor dubbed TEMP.Warlock, which has been seen at multiple intrusions where we have attributed the latter-stage operations to FIN6 and FIN7. While the targeted organizations observed in this recent spam campaign do not resemble traditional financial, retail, or hospitality targets, we consider this event significant because of recent trends in which relatively sophisticated financially motivated threat actors are pivoting to ransomware and extortion to monetize their network intrusion efforts. &nbsp;",
        "roles": {
            "adversary": [
                [
                    "financially motivated actor",
                    "TEMP.Warlock,"
                ],
                [
                    "FIN6"
                ],
                [
                    "FIN7"
                ]
            ],
            "capability": [
                [
                    "ransomware"
                ],
                [
                    "malicious email campaign"
                ],
                [
                    "FLAWEDAMMYYY payloads"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-46": {
        "doc": "APT41, a cyber espionage operation aligned with Chinese interests, is using MESSAGETAP malware to parse and log SMS data at a telecommunications company. MESSAGETAP leverages a keyword list to identify messages of interest, including those related to internal security issues and military ranks. The campaign exemplifies Chinese espionage efforts to collect information from further upstream in global network traffic flow instead of at the level of targeted organizations or individual end users.",
        "roles": {
            "adversary": [
                [
                    "APT41",
                    "a cyber espionage operation aligned with Chinese interests",
                    "Chinese espionage"
                ]
            ],
            "capability": [
                [
                    "keyword list"
                ],
                [
                    "MESSAGETAP malware",
                    "MESSAGETAP"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "telecommunications company"
                ]
            ]
        }
    },
    "fireeye-47": {
        "doc": "In mid-August 2019, FireEye Threat Intelligence identified multiple files that were being used to deliver the COOLPANTS backdoor. While we have not yet identified any phishing emails associated with this campaign, there is some indication the activity impacted an organization in Moldova, although targeting was likely broader than observed. Based on the use of overlapping tactics, techniques, and procedures (TTPs), we assess with low confidence that the recent KAYSLICE/COOLPANTS campaign can be attributed to TEMP.MetaStrike (aka Cobalt Group).",
        "roles": {
            "adversary": [
                [
                    "TEMP.MetaStrike",
                    "Cobalt Group"
                ]
            ],
            "capability": [
                [
                    "COOLPANTS backdoor",
                    "KAYSLICE/COOLPANTS"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "organization in Moldova"
                ]
            ]
        }
    },
    "fireeye-48": {
        "doc": "An unidentified actor targeted coalition forces, media outlets, government entities, and humanitarian aid organizations in a spear-phishing campaign in late July 2019. The emails leveraged \"Youth in Afghanistan\"-related lure content and contained a malicious Word document with additional decoy content to deliver a variant of xRAT malware to the targeted systems. We currently lack sufficient information to attribute this activity to a specific actor.",
        "roles": {
            "adversary": [
                [
                    "An unidentified actor",
                    "actor"
                ]
            ],
            "capability": [
                [
                    "spear-phishing"
                ],
                [
                    "malicious Word document"
                ],
                [
                    "xRAT malware"
                ]
            ],
            "infrastructure": [
                [
                    "emails"
                ]
            ],
            "victim": []
        }
    },
    "fireeye-49": {
        "doc": "FireEye Threat Intelligence identified a North Korean defector-themed spear-phishing campaign likely targeting entities and individuals with an interest in inter-Korean border issues with Windows and Android variants of DOGCALL malware. Based on overlaps in tactics, techniques, and procedures (TTPs), the use of DOGCALL malware, and the targeting of individuals with an interest in the cross-border conflict, we assess with high confidence that this activity is conducted by APT37. Entities and researchers with an interest in inter-Korean border issues remain at risk of targeting with DOGCALL malware in the short to medium term.",
        "roles": {
            "adversary": [
                [
                    "APT37"
                ]
            ],
            "capability": [
                [
                    "spear-phishing"
                ],
                [
                    "DOGCALL malware",
                    "DOGCALL malware",
                    "DOGCALL malware"
                ]
            ],
            "infrastructure": [
                [
                    "Windows and Android"
                ]
            ],
            "victim": [
                [
                    "Entities and researchers"
                ]
            ]
        }
    },
    "fireeye-50": {
        "doc": "In mid-August 2019, FireEye Threat Intelligence identified malicious URLs hosting HTA files that, if navigated to, resulted in the download of PowerShell Empire; links to these HTA files were posted on a Canadian stock forum messaging board. Based on overlaps in the attacker infrastructure, regional targeting, and the tactics, techniques, and procedures (TTPs) used throughout this recent activity and prior FIN10 campaigns, we have high confidence this activity can be attributed to FIN10. This recent campaign suggests that FIN10 continues to employ familiar TTPs, and we anticipate that these operations will persist in the near term.",
        "roles": {
            "adversary": [
                [
                    "FIN10",
                    "FIN10",
                    "FIN10"
                ]
            ],
            "capability": [
                [
                    "PowerShell Empire"
                ]
            ],
            "infrastructure": [
                [
                    "Canadian stock forum messaging board"
                ]
            ],
            "victim": []
        }
    },
    "fireeye-52": {
        "doc": "Screenshots leaked in June 2019 suggest Lebanese entities were targeted with DUALTONE malware, a .NET variant of TWOTONE, called Karkoff by its author. Submissions of DUALTONE samples to a public malware repository suggest a global port operator in Lebanon was likely also targeted with DUALTONE malware in March 2019. Based on targeting consistencies, samples uploaded to public malware repositories, and technical indicators, we assess with high confidence that APT34 is responsible for this activity and that related entities remain at risk of DUALTONE malware targeting.",
        "roles": {
            "adversary": [
                [
                    "APT34"
                ]
            ],
            "capability": [
                [
                    "DUALTONE malware",
                    "DUALTONE",
                    "DUALTONE malware",
                    "DUALTONE malware"
                ]
            ],
            "infrastructure": [
                [
                    "public malware"
                ]
            ],
            "victim": [
                [
                    "Lebanese entities",
                    "global port operator in Lebanon"
                ]
            ]
        }
    },
    "fireeye-53": {
        "doc": "FireEye Threat Intelligence identified a botnet panel named \"X-Key\" on a malicious IP server. The command and control (C&amp;C) server hosts the XKEYLOG malware, a keylogger that is also capable of taking screenshots. Among the files obtained from the sever is a screenshot of a human-machine interface (HMI) used to monitor Sulphur Recovery Units (SRUs). We believe the actor inadvertently accessed the HMI while searching for point-of-sale (POS) systems to facilitate credit card theft. The identification of this HMI screenshot highlights the continued accessibility of such systems by relatively unsophisticated threat actors. We recommend that companies conduct regular scans of their IP ranges to determine if any of their control systems are directly connected to the internet.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "botnet",
                    "\"X-Key\"",
                    "XKEYLOG malware",
                    "a keylogger"
                ],
                [
                    "command and control (C&amp;C) server"
                ],
                [
                    "malicious IP server"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-54": {
        "doc": "The Emotet botnet ceased its spam operations and distribution of secondary payloads between early June 2019 and mid-August 2019. Beginning on Aug. 21, 2019, FireEye Threat Intelligence observed several Emotet controllers delivering modules to existing bots. These controllers had been seen in previous Emotet operations. New Emotet samples were identified on Sept. 9, 2019, that contained new command and control (C&amp;C) infrastructure. FireEye Threat Intelligence has not yet identified any malicious email campaigns distributing Emotet, however, the presence of new infrastructure further suggests the Emotet botnet will return to full operation in the near future.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "command and control (C&amp;C) infrastructure"
                ],
                [
                    "Emotet botnet",
                    "Emotet",
                    "Emotet botnet"
                ],
                [
                    "Emotet controllers"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-55": {
        "doc": "In July 2019, FireEye Threat Intelligence identified a server hosting a collection of tools, including newly identified variants of two point-of-sale (POS) malware families, each of which were previously associated with only one distinct threat actor group, FIN7 or FIN8. While the exact nature of the relationship between the groups and their tools may be more easily assessed as activity continues, the presence of both FIN7 and FIN8 tools on the same server suggests that either some tools are not unique to the respective threat groups or some overlap exists between their associated actors. The server also contained a newly identified Ursnif variant we are tracking as SAIGON and two new malware families we are tracking as FLIPSWITCH and WOOLSOCKS. Analysis of the malware is ongoing and will be updated as additional information is uncovered. This observed activity is significant because it provides evidence of business relationships among criminal groups, which may enable the groups to attain higher levels of technical sophistication or to tackle larger projects.",
        "roles": {
            "adversary": [
                [
                    "threat actor group",
                    "respective threat groups",
                    "associated actors"
                ],
                [
                    "FIN7",
                    "FIN7"
                ],
                [
                    "FIN8",
                    "FIN8"
                ]
            ],
            "capability": [
                [
                    "SAIGON"
                ],
                [
                    "malware"
                ],
                [
                    "FLIPSWITCH"
                ],
                [
                    "WOOLSOCKS"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-57": {
        "doc": "FireEye Threat Intelligence identified a different variant of SCRAPMINT that has no exfiltration mechanism, does not communicate over the network, and expects a filename to be passed as an argument. This variant of SCRAPMINT was hosted on a server that also hosted multiple other point-of-sale (POS) malware and public tools. FireEye Threat Intelligence was able to gain additional insights into the threat actors' post-compromise activities preceding the deployment of SCRAPMINT from an XKEYLOG server. The modification of SCRAPMINT allows for smaller and less complex malware and gives actors the ability to deploy a separate exfiltration tool more suitable for a given&nbsp;victim&nbsp;environment.",
        "roles": {
            "adversary": [
                [
                    "threat actors"
                ]
            ],
            "capability": [
                [
                    "XKEYLOG server"
                ],
                [
                    "SCRAPMINT",
                    "SCRAPMINT",
                    "SCRAPMINT",
                    "SCRAPMINT"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-58": {
        "doc": "FireEye Threat Intelligence identified a BIODISK binary designed to compromise fingerprint-secured USB drives and may be used to infiltrate air-gapped networks. The BIODISK binary targeted a government and defense entity in the Asia-Pacific region. While attribution is unclear, the threat actor is highly sophisticated and likely conducted extensive reconnaissance against the victim environment.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "BIODISK",
                    "BIODISK"
                ]
            ],
            "infrastructure": [
                [
                    "fingerprint-secured USB drives"
                ]
            ],
            "victim": []
        }
    },
    "fireeye-59": {
        "doc": "In late August 2019, FireEye Threat Intelligence identified two waves of a phishing campaign that delivered KAYSLICE and COOLPANTS and leveraged domains spoofing Society for Worldwide Interbank Financial Telecommunication (SWIFT) and the European Central Bank. Based on overlaps in infrastructure and observed tactics, techniques, and procedures (TTPs), we assess with moderate confidence that this recent activity can be attributed to TEMP.MetaStrike. The most recent campaign employed two new delivery TTPs that were not observed in previous TEMP.MetaStrike campaigns, including the use of weaponized browser updates and IMG files to deliver malicious JavaScript and LNK files. The changes are consistent with our previous assessments that TEMP.MetaStrike regularly shifts its TTPs to remain undetected and increase the effectiveness of its campaigns.",
        "roles": {
            "adversary": [
                [
                    "TEMP.MetaStrike",
                    "TEMP.MetaStrike",
                    "TEMP.MetaStrike"
                ]
            ],
            "capability": [
                [
                    "weaponized browser"
                ],
                [
                    "malicious JavaScript and LNK"
                ],
                [
                    "phishing campaign",
                    "KAYSLICE",
                    "COOLPANTS"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "Society for Worldwide Interbank Financial Telecommunication (SWIFT)"
                ]
            ]
        }
    },
    "fireeye-60": {
        "doc": "In August 2019, Belarusian media outlets reported that a rogue electronic device was found under the server room of a paper mill in Svetlogorsk, Belarus. The device is allegedly capable of remotely damaging manufacturing processes and server equipment by causing a short circuit. Sources claim the device was planted by CAMCE, a Chinese contractor constructing the mill. CAMCE is also accused of extracting license keys from servers, deleting control logic, and dismantling a turbine control cable. While our independent research sheds doubt on the accuracy of this reporting, the incident highlights the unusually high risk sometimes posed by corporate entities and insiders. Organizations should audit third parties to detect potential illegitimate activity, particularly when contracts involve industrial safety and reliability design features.",
        "roles": {
            "adversary": [
                [
                    "corporate entities and insiders"
                ],
                [
                    "CAMCE",
                    "Chinese contractor",
                    "CAMCE"
                ]
            ],
            "capability": [
                [
                    "rogue electronic device"
                ]
            ],
            "infrastructure": [
                [
                    "server room of a paper mill in Svetlogorsk, Belarus"
                ]
            ],
            "victim": [
                [
                    "Belarusian media outlets"
                ]
            ]
        }
    },
    "fireeye-61": {
        "doc": "FireEye Threat Intelligence observed a spear-phishing campaign targeting entities in the virtual currency exchange sector with SOGU malware in June 2019. The activity leveraged Windows Control Panel objects to download and execute a SOGU payload on the victim's system. Similar entities in the virtual currency exchange sector and the financial services industry remain at risk of targeting by SOGU malware in the short to medium term.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "spear-phishing"
                ],
                [
                    "Windows Control Panel"
                ],
                [
                    "SOGU malware",
                    "SOGU payload",
                    "SOGU malware"
                ]
            ],
            "infrastructure": [
                [
                    "victim's"
                ]
            ],
            "victim": [
                [
                    "Similar entities in the virtual currency exchange sector and the financial services industry"
                ],
                [
                    "entities in the virtual currency exchange sector"
                ]
            ]
        }
    },
    "fireeye-62": {
        "doc": "In late August 2019, FireEye Threat Intelligence observed an email campaign delivering PACKETSPLIT and WSHRAT. The campaign appeared to impact financial services organizations based in Southeast Asia, although targeting may have been broader than what was directly observed. We have high confidence that this recent campaign can be attributed to TEMP.Splinter based on overlaps in tactics, techniques, and procedures (TTPs) with prior campaigns.",
        "roles": {
            "adversary": [
                [
                    "TEMP.Splinter"
                ]
            ],
            "capability": [
                [
                    "PACKETSPLIT and WSHRAT"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "financial services organizations based in Southeast Asia"
                ]
            ]
        }
    },
    "fireeye-65": {
        "doc": "In April and May 2019, FireEye Threat Intelligence reported on a network of social media accounts that we assessed were operating in support of Iranian interests that included accounts impersonating U.S. politicians and pretending to be journalists. In August 2019, we observed a resumption of activity by one of these accounts, which had been inactive since late May following the suspension of much of the rest of network. We have additionally identified what we believe is a related network of at least 20 inauthentic Twitter accounts conducting activity nearly identical to that of the reactivated account, predominantly the messaging directed at U.S. Representatives promoting specific narratives aligned with Iranian political interests.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-66": {
        "doc": "On Sept. 4, 2019, the North American Electric Reliability Corporation (NERC) released a \"Lessons Learned\" report providing additional details regarding a denial-of-service (DoS) incident that impacted a U.S. utility on March 5, 2019. The incident resulted from the exploitation of known vulnerabilities in firewall web interfaces. While the outages resulted in no major impacts to energy generation, the incident highlights that internet-connected perimeter devices&mdash;even in low-impact bulk electric systems (BES)&mdash;may expose networks to disruption or degradation threats. FireEye Threat Intelligence suggests that asset owners avoid internet connectivity for perimeter devices whenever feasible, configure firewalls to deny any traffic not explicitly allowed, and perform regular vulnerability assessments.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "denial-of-service (DoS)"
                ],
                [
                    "exploitation of known vulnerabilities"
                ]
            ],
            "infrastructure": [
                [
                    "firewall web interfaces"
                ]
            ],
            "victim": [
                [
                    "North American Electric Reliability Corporation (NERC)",
                    "U.S. utility"
                ]
            ]
        }
    },
    "fireeye-67": {
        "doc": "An ongoing spear-phishing campaign distributing the SOURCANDLE downloader has been targeting Japanese chemicals manufacturers since July 2019. Although we have no indications of direct intellectual property (IP) theft, cyber espionage operations targeting chemicals manufacturers may enable strategic decision making, especially amidst unstable market conditions.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "spear-phishing campaign"
                ],
                [
                    "SOURCANDLE downloader"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "Japanese chemicals manufacturers"
                ]
            ]
        }
    },
    "fireeye-68": {
        "doc": "The Emotet botnet ceased its spam operations and distribution of secondary payloads between early June 2019 and mid-August 2019. While we began to see limited Emotet activity beginning on Aug. 21, 2019, no spam campaigns had been identified. On Sept. 16, 2019, FireEye Threat Intelligence observed Emotet resume spamming using both German and English lures. Additionally, we identified secondary TrickBot and Ursnif (Gozi-ISFB) payloads being downloaded. There does not appear to be any notable evolution to the botnet's tactics, techniques, and procedures (TTPs), although we are continuing to analyze the recently observed Emotet executables to identify any changes.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "secondary payloads"
                ],
                [
                    "TrickBot"
                ],
                [
                    "Emotet botnet",
                    "Emotet",
                    "botnet's",
                    "Emotet"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-70": {
        "doc": "In late August 2019, the actor \"dihlofoss\" posted a complaint against another actor using the handle \"shitscrazy.\" According to this complaint, shitscrazy owed a significant amount of debt for \"cashed transfers. \"This recent complaint, as well as shitscrazy's other observed activities within the underground community, provides some evidence that shitscrazy has provided cashout services for the operators of the Dridex malware. Actor shitscrazy has shown consistent interest in multiple types of malicious activity within the past several years, and we expect this actor's activities will continue to pose a threat to organizations in diverse sectors and regions.",
        "roles": {
            "adversary": [
                [
                    "\"shitscrazy.\"",
                    "shitscrazy",
                    "shitscrazy",
                    "Actor shitscrazy",
                    "actor"
                ],
                [
                    "dihlofoss"
                ]
            ],
            "capability": [
                [
                    "Dridex malware"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-71": {
        "doc": "The SAKABOTA toolkit has targeted Middle Eastern government entities since late 2017 and may be used by an actor loosely tied to APT34. SAKABOTA is a modular .NET toolkit capable of leveraging additional payloads such as DIEZEN, SAKABOTA Eye, HISOKA, and LINKHIDE malware. Organizations that have previously been targeted by Iran-nexus espionage operations and government, financial, and consulting entities in the Middle East remain at high risk of targeting.",
        "roles": {
            "adversary": [
                [
                    "APT34"
                ]
            ],
            "capability": [
                [
                    "SAKABOTA",
                    "SAKABOTA",
                    "modular .NET toolkit"
                ],
                [
                    "SAKABOTA Eye"
                ],
                [
                    "DIEZEN"
                ],
                [
                    "HISOKA"
                ],
                [
                    "LINKHIDE malware"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "Middle Eastern government entities"
                ]
            ]
        }
    },
    "fireeye-73": {
        "doc": "FireEye Threat Intelligence has identified a network of suspected inauthentic accounts on Twitter and Facebook promoting content from the news site \"The BL\" (thebl.com) as well as political material in support of U.S. President Trump. The BL appears to be a legitimate news site that maintains pages in English, Chinese, Spanish, Portuguese, and Vietnamese. We have observed indications that The BL is linked to The Epoch Times and to The Sound of Hope Radio Network, media organizations that open sources have reported as linked to the Falun Gong (also known as Falun Dafa) movement. The practice of Falun Gong has been banned in China since 1999. Media outlets recently reported that Facebook banned The Epoch Times from future advertising on its platform due to alleged violations of its advertisement policies.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-74": {
        "doc": "A suspected APT33 campaign leveraged spoofed U.S. defense contractor domains to deliver POSHC2 and KOADIC malware. The domain naming conventions and an associated webpage advertise career opportunities in Riyadh, Saudi Arabia, with specific defense contractors. While the precise method of distribution of the suspected payloads remains unclear, a trusted third party has reported targeted emails associated with the domains.",
        "roles": {
            "adversary": [
                [
                    "APT33"
                ]
            ],
            "capability": [
                [
                    "POSHC2"
                ],
                [
                    "KOADIC malware"
                ]
            ],
            "infrastructure": [
                [
                    "domain naming conventions and an associated webpage"
                ]
            ],
            "victim": [
                [
                    "U.S. defense contractor"
                ]
            ]
        }
    },
    "fireeye-75": {
        "doc": "Based on newly obtained intelligence on infrastructure, FireEye Threat Intelligence is investigating the potential involvement of the Russia-nexus intrusion groups Sandworm Team and APT28 in two influence operations targeting Ukraine and Lithuania in 2018 and early 2019. The first operation was conducted in January 2018 with a compromise of the Ukrainian aircraft manufacturer Antonov's website and the publication of a fabricated letter written as if by Antonov's management with a narrative critical of the Ukrainian government. The second operation was conducted in April 2019, with the posting of a false article to the website of the Lithuanian news outlet \"Kas Vyksta Kaune,\" stating that the Lithuanian Minister of Defense was suspected of corruption.",
        "roles": {
            "adversary": [
                [
                    "Russia-nexus intrusion groups"
                ],
                [
                    "Sandworm Team"
                ],
                [
                    "APT28"
                ]
            ],
            "capability": [],
            "infrastructure": [
                [
                    "website"
                ],
                [
                    "website"
                ]
            ],
            "victim": [
                [
                    "Ukraine and Lithuania"
                ],
                [
                    "Ukrainian aircraft manufacturer Antonov",
                    "Antonov"
                ],
                [
                    "Lithuanian news outlet \"Kas Vyksta Kaune,\""
                ]
            ]
        }
    },
    "fireeye-77": {
        "doc": "Recent open-source reports describe new MANGOPUNCH activity targeting U.S. military personnel and Saudi Arabian information technology (IT) providers. FireEye Threat Intelligence observations, in conjunction with public disclosures, reveal a number of samples suggesting renewed Iran-nexus operations using MANGOPUNCH. While we have previously seen APT35 use MANGOPUNCH during intrusions in 2017, FireEye Threat Intelligence is withholding attribution at this time until more evidence becomes available.",
        "roles": {
            "adversary": [
                [
                    "Iran-nexus operations"
                ],
                [
                    "APT35"
                ]
            ],
            "capability": [
                [
                    "MANGOPUNCH",
                    "MANGOPUNCH",
                    "MANGOPUNCH"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "U.S. military personnel"
                ],
                [
                    "Saudi Arabian information technology (IT) providers"
                ]
            ]
        }
    },
    "fireeye-78": {
        "doc": "FireEye Threat Intelligence &nbsp;identified multiple modified TRITON framework executables uploaded to a malware analysis sandbox in September 2019. While the modified executables were apparently uploaded by a researcher, their release confirms our assessment and highlights that publicly available TRITON code can be used to develop new tools for intrusion. Targeted industrial control system (ICS) attack frameworks&mdash;like TRITON&mdash;can be difficult to scale because of the unique design of networks for different organizations. However, we highlight that access to this improved code can serve as a blueprint for future ICS attack frameworks.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "modified TRITON framework executables uploaded",
                    "TRITON code",
                    "TRITON&mdash;can"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-80": {
        "doc": "On Sept. 30, 2019, FireEye Threat Intelligence observed bots associated with TrickBot and IcedID receive identical commands to download a file. This file appeared to be a variant of the GlobeImpsoter ransomware based on publicly reported tactics, techniques, and procedures (TTPs) associated with this ransomware family. The activity highlights a recent trend in which a rising number of threat actors have incorporated ransomware into their operations presumably to diversify monetization tactics and achieve higher profits.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "TrickBot"
                ],
                [
                    "IcedID"
                ],
                [
                    "GlobeImpsoter ransomware"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-81": {
        "doc": "FireEye Threat Intelligence has identified a network of accounts on Twitter, Facebook, Instagram, and YouTube that we assess with moderate confidence are operating in a coordinated and inauthentic manner to push narratives in support of the Cuban Government and critical of the U.S.We assess with varying confidence levels that some of these accounts are using artificial intelligence (AI)-generated \"deepfake\" images as profile photos.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-83": {
        "doc": "Throughout late September and early October 2019, FireEye Threat Intelligence observed multiple phishing campaigns delivering KAYSLICE and COOLPANTS malware. Based on overlaps in infrastructure and observed targeting, we assess with moderate confidence that this recent activity can be attributed to TEMP.MetaStrike. We also identified overlaps between the TTPs used in these recent campaigns and an unattributed COOLPANTS campaign that occurred in mid-September 2019.",
        "roles": {
            "adversary": [
                [
                    "TEMP.MetaStrike"
                ]
            ],
            "capability": [
                [
                    "COOLPANTS malware",
                    "COOLPANTS"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "fireeye-84": {
        "doc": "FireEye Threat Intelligence uncovered a modified sample of the Russia-nexus Turla Team XTRANS malware, dubbed NETTRANS, likely targeting Brazilian entities in August 2019. Like XTRANS, NETTRANS communicates via encoded JPEG files sent via email for command and control (C&amp;C). It is unclear whether NETTRANS is intended to supplement or replace XTRANS and under what conditions each might be deployed.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "modified sample of the Russia-nexus Turla Team XTRANS malware",
                    "NETTRANS",
                    "NETTRANS",
                    "NETTRANS"
                ],
                [
                    "command and control (C&amp;C)"
                ],
                [
                    "XTRANS",
                    "XTRANS"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "Brazilian entities"
                ]
            ]
        }
    },
    "fireeye-85": {
        "doc": "FireEye Threat Intelligence discovered infrastructure leveraged by a suspected Iran-nexus actor to scan or compromise targets in the U.S., Israel, Saudi Arabia, United Arab Emirates (UAE), and others. The actor's activities were primarily focused on exploiting vulnerabilities in Pulse Connect Secure VPN or Fortinet FortiOS VPN applications.",
        "roles": {
            "adversary": [
                [
                    "suspected Iran-nexus actor",
                    "actor's"
                ]
            ],
            "capability": [],
            "infrastructure": [
                [
                    "Pulse Connect Secure"
                ],
                [
                    "Fortinet FortiOS VPN applications"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-1": {
        "doc": "A new CryptoMix, or CryptFile2, variant called Revenge has been discovered by Broad Analysis that is being distributed via the RIG exploit kit.   This variant contains many similarities to its predecessor CryptoShield, which is another CryptoMix variant, but includes some minor changes that are described below.\n As a note, in this article I will be referring to this infection as the Revenge Ransomware as that will most likely be how the victim's refer to it. It is important to remember, though, that this ransomware is not a brand new infection, but rather a new version of the CryptoMix ransomware family.\n How Victim's Become Infected with the Revenge Ransomware\n Both BroadAnalysis.com and Brad Duncan, of Malware-Traffic-Analysis.net, have seen Revenge being distributed through web sites that have been hacked so that the RIG Exploit Kit javascript is added pages on the site.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "Revenge",
                    "Revenge Ransomware",
                    "Revenge Ransomware",
                    "Revenge"
                ],
                [
                    "CryptoShield"
                ],
                [
                    "RIG Exploit Kit"
                ]
            ],
            "infrastructure": [
                [
                    "web sites"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-2": {
        "doc": "WhatsApp and Telegram have patched their respective web clients against a common security flaw discovered by researchers from Israeli firm Check Point, a security issue that would have allowed an attacker to take over user accounts and spy on conversations or steal user account data.\n According to researchers, the entry point was an attacker's ability to upload and send malicious code hidden inside HTML files.\n Both WhatsApp and Telegram would show a preview image for these links, making users believe they were accessing a video or image.\n Exploit granted attackers access to browser's localStorage\n In reality, when users clicked the links, malicious JavaScript code contained in the HTML files would execute and steal data from the user's browser localStorage.\n In layman's terms, localStorage is a term that describes a local container in the user's browser where data about a web application is stored.\n",
        "roles": {
            "adversary": [
                [
                    "attacker"
                ]
            ],
            "capability": [
                [
                    "malicious code hidden",
                    "malicious JavaScript code"
                ]
            ],
            "infrastructure": [
                [
                    "HTML files",
                    "HTML files"
                ],
                [
                    "user account"
                ],
                [
                    "browser's localStorage"
                ]
            ],
            "victim": [
                [
                    "WhatsApp",
                    "WhatsApp"
                ],
                [
                    "Telegram",
                    "Telegram"
                ]
            ]
        }
    },
    "bleeping-3": {
        "doc": "More than a third of the websites you visit online may include an outdated JavaScript library that's vulnerable to one or more security flaws.\n This is the conclusion of recent research carried out by a team of six scientists from the College of Computer and Information Science at Northeastern University, who scanned over 133,000 domains and found that 37% loaded outdated and insecure JavaScript libraries.\n Scan methodology\n The JavaScript ecosystem is the largest in the world, and the npm repository includes nearly 100,000 libraries. The scan did not cover all, but only 72 of the most popular JavaScript projects, such as jQuery, Angular, Handlebars, Bootstrap, Modernizr, Moment, LoDash, and others.\n To assess the state of each library, researchers also built their own database of vulnerabilities for the selected JavaScript projects.\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "vulnerable to one or more security flaws",
                    "database of vulnerabilities"
                ]
            ],
            "infrastructure": [
                [
                    "JavaScript library",
                    "JavaScript libraries",
                    "JavaScript projects",
                    "JavaScript projects"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-4": {
        "doc": "Since the Cerber Ransomware was first released back in early March of 2016, this ransomware would not only encrypt your files, but would also annoyingly encrypt the file names as well. This made it difficult for users and administrators to determine what files were actually encrypted and restore them from backups.\n While many variants of Cerber have been released over time, this \"feature\" has always remained the same. That is until today, when both Emsisoft researcher Sarah, otherwise known as xXToffeeXx, and SwiftOnSecurity found a new sample of Cerber that leaves the original filename the same and only appends a random extension as shown below.\n\n\n Cerber Encrypted Files\n\n\nAs you can see from the above picture, this new variant will keep the original filename, but now append a random extension to the filename. According to Sarah, this extension will be the same for all files encrypted on a particular machine, but will be different from machine to machine.\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "\"feature\""
                ],
                [
                    "Cerber Ransomware",
                    "Cerber",
                    "Cerber"
                ]
            ],
            "infrastructure": [
                [
                    "original filename",
                    "original filename",
                    "this extension"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-5": {
        "doc": "Version 57 of the Google Chrome for Android, Chrome OS, Linux, Mac, and Windows is available for download, or update, using the browser's built-in update feature.\n Chrome's new release comes with two new main features, a host of improvements to existing browser APIs, and 36 security fixes.\n The biggest addition to Chrome 57 is support for WebAssembly, a new standard for packing and delivering web pages. We've already gone through WebAssembly's major benefits in a previous story, two days ago, when Firefox 52 became the first browser to offer WebAssembly support in its stable branch.\n CSS Grid Layout\n The other major feature in Chrome 57 is actually a big deal for developers.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-6": {
        "doc": "For many years, MAC Address Randomization was slated as the next big thing for protecting user privacy on the modern Internet.\n The standard, which works by deploying a new MAC address to a device in order to break down user tracking attempts, is still under development at the IEEE (Institute of Electrical and Electronics Engineers) and has already passed a few security tests.\n Attack breaks MAC Address Randomization on all devices\n Now, four scholars from the US Naval Academy say they've managed to track 100% of all test smartphones, despite the devices using randomized MAC addresses.\n The technique worked across all tested manufacturers, and the researchers say this was possible because of a previously unknown flaw in the way wireless chipsets handle low-level control frames.\n Their work was based on previous research released in 2016 by researchers from Belgium and France, who used a similar technique to track 50% of tested smartphones, despite using MAC address randomization.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-8": {
        "doc": "Today Microsoft released Insider Preview Build 15055 to PC and Mobile insiders on the fast ring, Like the previous release, this release focuses on fixing bugs and does not provide any new features.\n Of particular note, are the resolution of installation issues that people were experiencing in previous builds. Below is the full list of changes in this version.\n Other changes, improvements, and fixes for PC\n\n If you have Symantec/Norton anti-virus software installed on your PC, you should no longer get an 0x80070228 error when attempting to download this build. Symantec released updated anti-virus definitions last week that fixes this issue. ",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-11": {
        "doc": "Willem de Groot, a Dutch security expert, is asking owners of defunct or soon-to-be-dead online stores to donate their domains so he can set up honeypots and track credit card stealing malware and other types of cyber-attacks on e-commerce targets.\n De Groot, who is also the co-founder of Byte.nl, a web hosting service, and founder of MageReport, a security scanner for Magento shops, says he needs store owners to donate their former domains because classic honeypots won't work against web malware, and in particular against variants targeting online stores.\n Honeypots are servers that are configured to behave like various types of applications, but they also run monitoring software that logs any attempts to exploit security weaknesses.\n E-commerce honeypots aren't always efficient\n For online stores, setting up a honeypot server implies creating a store from scratch. This is useless, de Groot says, as the store won't have any search engine presence, and attackers could easily detect this.\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "credit card stealing malware",
                    "web malware"
                ]
            ],
            "infrastructure": [
                [
                    "honeypots",
                    "honeypots",
                    "Honeypots",
                    "servers",
                    "honeypots",
                    "honeypot server"
                ],
                [
                    "domains",
                    "former domains"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-12": {
        "doc": "WikiLeaks dumped 12 new documents today that provide a more in-depth look at the hacking techniques the CIA allegedly used to hack Apple devices, such as Macs and iPhones.\n This dump, which WikiLeaks identifies under the Dark Matter codename, is part of a series of dumps called Vault 7, which WikiLeaks claims are hacking tools obtained from the CIA.\n The first Vault 7 dump, named Year Zero, came to light at the start of March and included wiki pages from the CIA's intranet, containing documentation for some of the CIA's cyber-weapons.\n Dark Matter includes details on lots of EFI/UEFI implants\n Included in this original leak were documents related to CIA's alleged arsenal of OS X and iOS hacking tools. Today's Dark Matter dump provides 12 new documents that contain a lot more information on those tools.\n\n",
        "roles": {
            "adversary": [
                [
                    "CIA",
                    "CIA",
                    "CIA",
                    "CIA",
                    "CIA"
                ]
            ],
            "capability": [
                [
                    "hacking techniques",
                    "hacking tools",
                    "cyber-weapons",
                    "alleged arsenal of OS X and iOS hacking tools"
                ]
            ],
            "infrastructure": [
                [
                    "Apple devices"
                ],
                [
                    "EFI/UEFI implants"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-14": {
        "doc": "Some of the malicious Android Minecraft mods (ESET)\n\n\nNews of malicious Android apps hosted on the Google Play Store doesn't seem to stop coming these days, as ESET and Zscaler researchers recently disclosed they've reported nearly 100 malicious apps they recently come across.\n The biggest batch comes from ESET security researcher Lukas Stefanko, who says that between March 16 and 21, he reported to Google 87 Android apps posing as Minecraft mods, but which, in reality, contained two malware (adware) strains.\n In total, the researcher says, the apps reached up to 990,000 installs before Google took them down.\n None of the apps contained any Minecraft functionality\n Stefanko says that none of these apps contained any legitimate functionality, being mere vessels for adware. The apps would only work during the installation process, focusing on luring the user into granting them admin privileges.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "malicious Android Minecraft mods",
                    "malicious Android apps",
                    "100 malicious apps",
                    "87 Android apps posing as Minecraft mods",
                    "the apps",
                    "the apps",
                    "these apps",
                    "The apps"
                ]
            ],
            "infrastructure": [
                [
                    "Google Play Store"
                ]
            ],
            "victim": [
                [
                    "user"
                ],
                [
                    "Google",
                    "Google"
                ]
            ]
        }
    },
    "bleeping-15": {
        "doc": "As everyone kind of expected, Google Chrome, the world's leading browser with a comfortable market share of above 50%, is also the most installed software package.\n This is one of several findings of a report from Czech security giant Avast, which aggregated anonymous usage data from a whopping of 116 million PCs.\n According to Avast, second to Google Chrome in term of the number of active installs is Adobe's Reader app, followed by Flash Player (Active X version). The rest of the top 10 is made up by Firefox, the Flash Player Plugin, Skype, VLC Player, WinRAR, Java, and Adobe AIR.\n\n The data from Avast's report was gathered via AVG TuneUp’s Automatic Software Updater feature, therefore, it also included details on the version number of each software package.\n More than half of active software installs are out-of-date\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-16": {
        "doc": "Security researcher Dylan Ayrey detailed last week a new web-based attack named XSSJacking that combines three other techniques  — Clickjacking, Pastejacking, and Self-XSS — to steal data from careless users.\n Ayrey says XSSJacking can help attackers reach sensitive information for which they would normally need a more complex security flaw, such as a stored XSS (Cross-Site Scripting) or CSRF (Cross-Site Request Forgery), issues which most websites tend to fix when reported.\n The attack is not fully-automated, as it still relies on social engineering, a reason why many of today's security bug bounty programs won't even consider it as a security flaw, Ayrey told Bleeping Computer in an email.\n Some conditions must be met fo XSSJacking attacks\n For an XSSJacking attack to take place, some conditions must be met, but in hindsight, all attacks, even CSRF and SQL injections, all need one or more special conditions.\n For example, in the case of XSSJacking, the target website must be vulnerable to clickjacking.\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "XSSJacking",
                    "XSSJacking",
                    "XSSJacking",
                    "XSSJacking",
                    "XSSJacking"
                ],
                [
                    "CSRF (Cross-Site Request Forgery)",
                    "CSRF"
                ],
                [
                    "social engineering"
                ],
                [
                    "XSS (Cross-Site Scripting)"
                ],
                [
                    "SQL injections"
                ]
            ],
            "infrastructure": [
                [
                    "websites",
                    "target website"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-17": {
        "doc": "A botnet specialized in gift card fraud is using the infrastructure of nearly 1,000 websites to check the balance of several types of electronic gift cards in order to defraud legitimate card owners.\n Distil Networks, a cybersecurity firm specialized in bot attack detection, monitoring, and mitigation, says the botnet, nicknamed GiftGhostBot, has started attacks on February 26, this year.\n Attacks aimed at online stores\n The operators of this botnet aimed their attacks at the infrastructure embedded in some of the targeted websites, most of which are online stores.\n These websites allow their customers to buy products with gift cards, and support end points for interacting with the card's issuer.\n Operators of the GiftGhostBot botnet launch brute-force attacks against these endpoints.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "botnet",
                    "botnet",
                    "GiftGhostBot",
                    "GiftGhostBot botnet"
                ]
            ],
            "infrastructure": [
                [
                    "infrastructure of nearly 1,000 websites",
                    "online stores",
                    "infrastructure",
                    "targeted websites",
                    "online stores",
                    "These websites"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-18": {
        "doc": "Lots and lots of little crappy ransomware released this week with nothing new or innovative. We do have some interesting Spora stats, lots of new Jigsaw variants, a story on the decline of Locky, and of course an updated decryptor by Fabian Wosar who continues to kick ransomware in the buttocks. Other than that, not really any of significance.\n Contributors and those who provided new ransomware information and stories this week include: @malwrhunterteam, @PolarToffee, @fwosar, @struppigel, @demonslay335,  @malwareforme, @jorntvdw, @FourOctets, DanielGallagher, @campuscodi, @JAMESWT_MHT, @Seifreed, @JakubKroustek, @BleepinComputer, @erpscan, @barklyprotects. \n If you are interested in ransomware or InfoSec, I suggest you follow them on Twitter.\n March 18th 2017\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "crappy ransomware",
                    "ransomware",
                    "new ransomware"
                ],
                [
                    "Jigsaw variants"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-19": {
        "doc": "During the past year, Let's Encrypt has issued a total of 15,270 SSL certificates that contained the word \"PayPal\" in the domain name or the certificate identity.\n Of these, approximately 14,766 (96.7%) were issued for domains that hosted phishing sites, according to an analysis carried out on a small sample of 1,000 domains, by Vincent Lynch, encryption expert for The SSL Store.\n Security experts have warned of Let's Encrypt abuse\n Lynch's analysis comes to confirm some of the fears voiced as early as 2015, around Let's Encrypt's early launch phase.\n Encryption and infosec experts warned that by providing free SSL certificates; phishers, tech support scammers, and other malware authors would flock to obtain free certificates and move their operations on HTTPS domains.\n The first of these security incidents was a malvertising campaign that used",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "phishing sites"
                ],
                [
                    "malvertising campaign"
                ]
            ],
            "infrastructure": [
                [
                    "SSL certificates",
                    "free SSL certificates",
                    "free certificates"
                ],
                [
                    "domains",
                    "1,000 domains",
                    "HTTPS domains"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-20": {
        "doc": "Yesterday, Google announced plans to completely shut down the Google Talk service after June 26, 2017.\n Google Talk, often referred to by its unofficial names of Gchat, Gtalk, or Gmail Chat, was launched in 2005, one year after Google launched Gmail, and was available as a desktop client and mobile app, but also as a web-based service embedded in the Gmail inbox.\n Google started phasing out Google Talk in 2015\n In February 2015, Google shut down most of the desktop and mobile clients and recommended users to move to its newer Google Hangouts service.\n In spite of the announcement, Google left Talk server running, and many users just switched to XMPP clients like Adium, Gajim, or Pidgin to talk to their friends.\n Now, Google will bring the final ax over Google Talk's head on June 26.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-21": {
        "doc": "The browser wars are starting to heat up again as both Google and Microsoft promote their software at the expense of their competitors. Such is the case with a new notification shown in the Chrome Web Store telling Microsoft Edge users to switch to Google Chrome.\n Earlier this month, Microsoft started to display promotions in the Windows 10 Start Menu that suggest Firefox users should switch to the Microsoft Edge browser.\n\n Windows 10 Start Menu Promoting Microsoft Edge\n Now we have the Chrome Web Store telling Microsoft Edge users that they should switch to Google Chrome for better security.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-22": {
        "doc": "An archive with over 10 million records of guests at the MGM Resorts hotels is currently distributed for free on a hacking forum.\n The data comes from a security breach in July 2019 on one of MGM cloud services. In total, there are 10,683,189 records with about 3.1 million unique email addresses as far back as 2017.\n Some data still valid\n Among the details compromised are guests' names, dates of birth, email addresses, phone numbers, and physical addresses complete with postal codes.\n The post sharing the information was spotted by a researcher at Under the Breach, a company that monitors the cybercrime space and currently working on releasing a new service aiming to provide companies intelligence about potential breaches.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": [
                [
                    "10 million records of guests",
                    "guests"
                ],
                [
                    "MGM Resorts hotels",
                    "MGM"
                ]
            ]
        }
    },
    "bleeping-23": {
        "doc": "Security researchers discovered a new batch of nine websites infected with malicious JavaScript that steals payment card info from online shoppers.\n Some of them were infected a second time and the script persisted, despite efforts from the researchers to contact the website owners.\n The script is attributed to MageCart Group 12, as per extensive analysis from RiskIQ a threat actor that is changing tactics as their tricks are being published in security reports.\n Code obfuscation does not help\nMore recent activity linked to this actor was documented by researchers Jacob Pimental and Max Kersten towards the end of January when they published details about two sports events ticket resellers running card skimming code.\n The two researchers noticed that the skimmer is hosted on 'toplevelstatic.com,' which resolves to multiple IP addresses, mostly in Russia.\n\n \"",
        "roles": {
            "adversary": [
                [
                    "MageCart Group 12",
                    "a threat actor",
                    "their",
                    "this actor"
                ]
            ],
            "capability": [
                [
                    "nine websites",
                    "website"
                ],
                [
                    "malicious JavaScript",
                    "script"
                ],
                [
                    "malicious JavaScript"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "website owners"
                ],
                [
                    "online shoppers"
                ]
            ]
        }
    },
    "bleeping-24": {
        "doc": "The number of WhatsApp phishing URLs has skyrocketed in Q4 2019 after a 13,467.6% huge QoQ surge in the number of unique phishing URLs targeting its users being discovered by email security company Vade Secure since Q3 2019.\n Vade Secure's Phishers' Favorites report for Q4 2019 highlights the 25 most impersonated brands in phishing attacks with the list being compiled after examining phishing URLs detected by Vade Secure's technology. \n \"Leveraging data from more than 600 million protected mailboxes worldwide, Vade's machine learning algorithms identify the brands being impersonated as part of its real-time analysis of the URL and page content,\" Vade Secure says. \n WhatsApp's 5,020 unique phishing URLs detected by Vade Secure and its ascent as the 5th most impersonated brand in phishing attacks (up 63 spots) was the driving force behind social media brands' increase in the share of URLs used in phishing attacks from 13.1% in Q3 to 24.1% in Q4 2019.\n Vade Secure explains that \"the staggering growth in phishing URLs stems primarily from a campaign inviting recipients to the so-called Berbagi WhatsApp group, which advertises pornographic content.\n \"Moreover, it appears web hosting provider 000webhost was hacked and used to host the phishing pages.",
        "roles": {
            "adversary": [
                [
                    "Berbagi WhatsApp group"
                ]
            ],
            "capability": [
                [
                    "WhatsApp phishing URLs",
                    "phishing URLs",
                    "phishing URLs",
                    "5,020 unique phishing URLs",
                    "URLs",
                    "phishing URLs"
                ]
            ],
            "infrastructure": [
                [
                    "600 million protected mailboxes worldwide"
                ]
            ],
            "victim": [
                [
                    "users",
                    "recipients"
                ]
            ]
        }
    },
    "bleeping-25": {
        "doc": "The FTC has begun to issue refunds to people who were convinced into purchasing computer repair services at Office Depot based on fake malware scans.\n Between 2009 and November 2016, Office Depot and Office Max employees utilized a diagnostic program called 'PC Health Check' that would in many cases report a person's computer had malware even if it was not infected.\n\n PC Health Check software interface\n Whistleblowers told KIRO7 reporters that the employees were pressured into utilizing PC Health Check even though it was known to not be accurate to convince people to purchase repair services ranging from $180 to $300.\n KIRO7 reporters tested this by taking six brand new laptops to various Office Depot locations, where they were falsely told four out of the six laptops were infected and were prompted to purchase repair services.\n Office Depot settles with the FTC\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-26": {
        "doc": "Microsoft has started rolling out new Fluent-based icons for Windows 10 apps and system applications to Insiders on the Fast Ring.\n Starting today with the Windows 10 Mail and Calendar icons, Microsoft is slowly releasing new updated and colorful icons to users running Windows 10 Insider builds\n\n Evolution of the Windows Mail Icon\n These icons will be phased in over the next couple of months through app updates via the Microsoft Store and via release previews of Windows 10.\n Windows 10 Insiders in the Fast Ring will start to see the new icons sooner as they are pushed out in new versions of apps being tested by Insiders.\n As reported by Aggiornamentilumia.it, for some people these icons have already started rolling out to Insider builds.\n\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-27": {
        "doc": "Google is facing a new lawsuit for allegedly using its Google for Education platform to gather the personal and private data from students under the age of thirteen.\n As part of the Google for Education platform, United States schools are offered free Google Chromebooks and access to the G Suite for Education service.\n This service gives students access to Gmail, Classroom, online word processing, and presentation applications to do schoolwork, homework, communicate with teachers and submit assignments.\n To comply with Children'S Online Privacy Protection Act (COPPA), online platforms are required to get the parental consent of children under the age of 13 before allowing them to use their service or gather information about them.\n In a lawsuit filed Thursday, New Mexico Attorney General Hector Balderas states that Google is allegedly attempting to bypass this law through Google Education to mine the data of the students who use it.\n \"Outside of its Google Education platform, Google forbids children under the age of 13 in the United States from having their own Google accounts.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-28": {
        "doc": "Google reacted severely against nearly 600 Android apps in Play Store that were violating two ad-related policies by kicking them out of the repository.\n The penalty went further with banning the apps from the company's ad monetization platforms (Google AdMob and Google Ad Manager), essentially cutting authors any hope of getting revenue from their apps through Google.\n Ad-serving principles\n In an announcement today, the company explains that offensive apps featured advertisements in a way that was in contrast with the disruptive ads and disallowed interstitial policies.\n The two principles infringed ensure smooth user experience and help combat mobile the many forms of ad fraud, including harmless apps that disobey the rules.\n When referring to disruptive ads, Google describes them as displayed in a way that could cause the user to click them unintentionally. \n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-29": {
        "doc": "If you are using older Intel processors or AMD processors, you can boost the performance of Windows 10 by enabling the Retpoline Spectre mitigations that were recently ported to Windows 10 October 2018 Update build 1809.\n In order to mitigate the Spectre vulnerabilities in Windows 10, Microsoft had introduced fixes that caused a performance decrease, which were more noticeable in older CPUs.   To resolve these performance issues, Microsoft has been testing a new mitigation technique called Retpoline in Windows Insider Preview builds since build 18272.\n This mitigation has recently been backported to Windows 10 October 2018 Update build 1809, but is being slowly rolled out over time as they test its performance in large-scale public use. If you do not want to wait, you can use the instructions below to enable it immediately on supported processors.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-30": {
        "doc": "Screenshots of Microsoft's in-house Edge Chromium-based web browser have leaked online, showing the large amounts of user interface DNA the two browsers share with each other and providing details on a future Microsoft Edge Store.\n Microsoft announced during early December that they will be giving up on the current code base of their Microsoft Edge browser switching to Google's open-source Chromium and that the nametag will remain unchanged even though the app will be a whole different beast inside and outside.\n Since then there were no other details released about the project through official channels, however, as it usually happens with projects developed behind closed doors, there were a number of leaks allowing us to get a glimpse of what the end product will look like.\n\n After app icons and some installer screenshots of the new Edge browser have been leaked at the end of February, Neowin also published a set of leaked snapshots of an in-house test preview build of the Chromium-based Edge on March 5.\n The screenshots show that Microsoft's new Edge will share a lot with Google's Chrome on the user interface side, but it will also come with a number of unique features such as an integrated news feed powered by Microsoft News, Bing as the default search engine, and Microsoft accounts used for syncing.  \n While Redmond previously confirmed that the new Chromium-based Edge should support current Chrome extensions, the leaked screenshots of this Chromium-based Edge build designed for internal testing show that the browser will come with its own Microsoft Edge Store.\n\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-31": {
        "doc": "Microsoft has released Windows 10 Insider Preview Build 18351 for Insiders in the Fast ring. As the 19H1 builds move closer to being released, we should expect to see only bug fixes and no new major features being added to this development branch.\n If you are a Windows Insider in the Fast ring, you can update to the Insider Preview Build 18351 by going into  Settings ->  Update & Security -> Windows Update and then checking for new updates.\n\n\n Windows 10 Insider Preview Build 18351",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-32": {
        "doc": "With the high ransom prices and big payouts of enterprise-targeting ransomware, we now have another ransomware known as Mailto or Netwalker that is compromising enterprise networks and encrypting all of the Windows devices connected to it.\n In August 2019 a new ransomware was spotted in ID Ransomware that was named Mailto based on the extension that was appended to encrypted files.\n It was not known until today when the Australian Toll Group disclosed that their network was attacked by the Mailto ransomware, that we discovered that this ransomware is targeting the enterprise.\n It should be noted that the ransomware has been commonly called the Mailto Ransomware due to the appended extension, but analysis of one of its decryptors indicates that it is named Netwalker.   We will discuss this later in the article.\n The Mailto / Netwalker ransomware\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "enterprise-targeting ransomware",
                    "another ransomware",
                    "Mailto",
                    "Netwalker",
                    "a new ransomware",
                    "Mailto",
                    "Mailto ransomware",
                    "the ransomware",
                    "the Mailto Ransomware",
                    "Netwalker"
                ]
            ],
            "infrastructure": [
                [
                    "enterprise networks"
                ]
            ],
            "victim": [
                [
                    "Australian Toll Group",
                    "the enterprise"
                ]
            ]
        }
    },
    "bleeping-33": {
        "doc": "Medicaid coordinated care organization (CCO) Health Share of Oregon today disclosed a data breach exposing the health and personal info of 654,362 individuals following the theft of a laptop owned by its transportation vendor GridWorks IC.\n The non-profit organization is Oregon's largest Medicaid CCO and it serves the Oregon Health Plan (Medicaid) members in Clackamas, Multnomah, and Washington counties.\n \"On January 2, 2020, Health Share of Oregon learned that the personal information of its members was located on a laptop stolen from GridWorks IC, Health Share's contracted non-emergent medical transportation (Ride to Care) vendor,\" says the CCO in a statement issued today.\n \"The break-in and theft occurred at GridWorks' office on November 18, 2019. \"\n Data breach exposes personal and health information\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "data breach"
                ]
            ],
            "infrastructure": [
                [
                    "GridWorks' office"
                ],
                [
                    "laptop",
                    "laptop"
                ]
            ],
            "victim": [
                [
                    "Medicaid coordinated care organization (CCO) Health Share of Oregon",
                    "Oregon's largest Medicaid CCO",
                    "Health Share of Oregon",
                    "Health Share",
                    "the CCO"
                ],
                [
                    "654,362 individuals",
                    "its members"
                ],
                [
                    "GridWorks IC",
                    "GridWorks IC",
                    "GridWorks"
                ]
            ]
        }
    },
    "bleeping-34": {
        "doc": "Security researchers taking a closer look at the Philips Hue smart bulbs and the bridge device that connects them discovered a vulnerability that helped them compromise more meaningful systems on the local network.\n The security flaw was discovered is in the ZigBee wireless communication protocol that is used by a wide range of smart home devices.\n From bulb to bridge to network\n Tracked as CVE-2020-6007, the bug has a severity score of 7.9 out of 10. It is a heap buffer overflow that can be exploited remotely in Philips Hue Bridge model 2.x to execute arbitrary code. Affected firmware versions are up to 1935144020, released on January 13.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "ZigBee wireless communication protocol"
                ]
            ],
            "victim": [
                [
                    "Philips Hue",
                    "Philips Hue"
                ]
            ]
        }
    },
    "bleeping-37": {
        "doc": "The attackers behind the RobbinHood Ransomware are exploiting a vulnerable GIGABYTE driver to install a malicious and unsigned driver into Windows that is used to terminate antivirus and security software.\n When performing a network-wide compromise, ransomware attackers need to push out a ransomware executable as quickly as possible and to as many systems as they can to avoid being detected.\n One protection that can get in their way of a successful attack, though, is antivirus software running on a workstation that removes the ransomware executable before it can be executed.\n To overcome this hurdle, the operators behind the RobbinHood Ransomware are utilizing a custom antivirus killing package that is pushed out to workstations to prepare it for encryption.\n Using trusted drivers to terminate security processes\nMost Windows security software processes are protected from being terminated by regular processes and can only be terminated by Kernel drivers, which have the highest permission possible in Windows.\n To better secure Windows, Microsoft added a driver signature enforcement policy that prevents the installation of Windows Kernel drivers unless they have been cosigned by Microsoft.\n",
        "roles": {
            "adversary": [
                [
                    "ransomware attackers"
                ]
            ],
            "capability": [
                [
                    "custom antivirus killing package"
                ],
                [
                    "ransomware executable",
                    "ransomware executable"
                ],
                [
                    "RobbinHood Ransomware",
                    "RobbinHood Ransomware"
                ]
            ],
            "infrastructure": [
                [
                    "a vulnerable GIGABYTE driver"
                ],
                [
                    "Windows",
                    "Windows",
                    "Windows",
                    "Windows"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-38": {
        "doc": "The U.S. Department of Justice (DoJ) today issued a notification to raise awareness among victims of the Quantum Stresser Distributed Denial of Service (DDoS) for-hire service operated by David Bukoski.\n DDoS-for-hire services known as booters or stressers are used by malicious actors, pranksters, or hacktivists to launch large-scale DDoS cyberattacks against a targeted site or online service, triggering a denial of service that leads to the service being taken down or working a lot slower than usual.\n \"Due to the large number of potential victims in this case, Chief U.S. District Judge Timothy M. Burgess issued an order directing the government to employ alternative victim notification procedures so that any member of the community at large who believes they may be a crime victim is made aware of their potential rights,\" the DoJ statement says.\n \"The government is asking that members of the community who believe they may be a victim of Bukoski’s criminal activities, to please contact (907) 271-3041 to reach the Victim-Witness Unit at the U.S. Attorney’s Office, District of Alaska.\"\n This notification was the result of a motion for alternative victim notification filed on February 3 which also says that there are \"plans to notify –   to the extent possible – those ISPs providing services to victim networks, who may be able to conduct additional notification of their own customers. \"\n The DoJ has scheduled a restitution hearing on May 5, 2020, at 10:30 A.M. in Anchorage.\n\n\n",
        "roles": {
            "adversary": [
                [
                    "malicious actors"
                ],
                [
                    "David Bukoski",
                    "Bukoski"
                ]
            ],
            "capability": [
                [
                    "DDoS-for-hire services"
                ],
                [
                    "Denial of Service (DDoS)",
                    "DDoS cyberattacks",
                    "denial of service"
                ]
            ],
            "infrastructure": [
                [
                    "victim networks"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-39": {
        "doc": "Android users are targeted in a phishing campaign that will infect their devices with the Anubis banking Trojan that can steal financial information from more than 250 banking and shopping applications.\n The campaign uses a devious method to get the potential victims to install the malware on their devices: it asks them to enable Google Play Protect while actually disabling it after being granted permissions on the device.\n To deliver the malware, the attackers use a malicious link embedded within the phishing email that will download an APK file camouflaged as an invoice as Cofense found.\n After being asked if he wants to use Google Play Protect and installing the downloaded APK, the victim's device will be infected with the Anubis Trojan.\n\n Google Play Protect used as cover (Cofense)\n Targets over 250 financial applications\n",
        "roles": {
            "adversary": [
                [
                    "the attackers"
                ]
            ],
            "capability": [
                [
                    "malicious link"
                ],
                [
                    "phishing campaign",
                    "phishing email"
                ],
                [
                    "APK file"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "Android users",
                    "victim"
                ]
            ]
        }
    },
    "bleeping-41": {
        "doc": "Hewlett Packard Enterprise (HPE) is once again warning its customers that certain Serial-Attached SCSI solid-state drives will fail after 40,000 hours of operation, unless a critical patch is applied.\n The company made a similar announcement in November 2019, when firmware defect produced failure after 32,768 hours of running.\n Affected drives\n The current issue affects drives in HPE server and Storage products like HPE ProLiant, Synergy, Apollo 4200, Synergy Storage Modules, D3000 Storage Enclosure, StoreEasy 1000 Storage.\n HPE Model Number\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-43": {
        "doc": "A new deal is available for more than 96% off The Foundational Cisco CCNA Security Bundle.\n This deal is for a bundle that contains 3 courses and over 50 hours of training for the Cisco's CCNA certification exam track. This bundle normally has a value of $897, but has been discounted 96% to $29 as part of this deal. \n Please note that exam vouchers are not included with this deal.\n If Cisco certifications are not what you are looking for, we also have a The Docker and Kubernetes Certification Training Bundle for $15.99 and a CompTIA IT Certification Bundle for $49.\n BUNDLE DESCRIPTION:\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-44": {
        "doc": "Adobe has published their monthly Patch Tuesday updates for the month of March 2019. These updates fix security arbitrary code execution vulnerabilities in Photoshop and Adobe Digital Editions.\n This type of vulnerability is classified as critical as they could allow attackers to run virtually any program under the security context of the exploited user. This could lead to malware being installed without the knowledge or permission of the user.\n Adobe Security Updates Summary:\n APSB19-15 Security updates available for Adobe Photoshop CC\n",
        "roles": {
            "adversary": [
                [
                    "attackers"
                ]
            ],
            "capability": [],
            "infrastructure": [
                [
                    "execution vulnerabilities",
                    "vulnerability"
                ],
                [
                    "Photoshop and Adobe Digital Editions"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-45": {
        "doc": "Microsoft has added beta support Android app screen mirroring in Windows 10 Build 1803 or newer for the latest Insider builds.\n At the moment the feature is only compatible with a limited number of devices but it will be supported by all smartphones running Android version 7.0 or later.\n As detailed in the \"Phone screen – supported devices\" page on Microsoft's community website, the company provides \"an early preview into the newest feature for the Your Phone app – phone screen. You can now mirror your Android phone’s screen directly on your PC without having to dig for your phone.\"\n Microsoft previously demoed the Windows 10 Your Phone app during October 2018 at the company’s Surface event, as first reported by The Verge.\n\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-46": {
        "doc": "A modular malware with worm capabilities exploits known vulnerabilities in servers running ElasticSearch, Hadoop, Redis, Spring, Weblogic, ThinkPHP, and SqlServer to spread from one server to another and mine for Monero cryptocurrency.\n Systemctl.exe, the worm module of the malware named PsMiner by the 360 Total Security researchers, is a Windows binary written in the Go language which bundles all the exploit modules used to hack into vulnerable servers it can find on the Internet.\n Besides the exploits, PsMiner's worm module also has the capability to brute force its way in, whenever it finds targets that uses weak or default credentials, as well as crack user credentials using an additional brute force password cracking component.\n Once it manages to infiltrate a victim's computer, PsMiner will execute a PowerShell command which downloads a WindowsUpdate.ps1 malicious payload, the malware's master module designed to drop the Monero miner as part of the final infection stage.\n\n\n The infection process\n\n\n The malware will also copy the malicious WindowsUpdate.ps1 script to the Windows Temp folder and will create an \"Update service for Windows Service\" scheduled task designed to re-launch the main malware module every 10 minutes to help it keep persistence on the compromised system.\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "worm capabilities",
                    "worm module",
                    "worm module"
                ],
                [
                    "A modular malware",
                    "the malware",
                    "PsMiner",
                    "PsMiner",
                    "PsMiner",
                    "the malware"
                ],
                [
                    "PowerShell command"
                ],
                [
                    "WindowsUpdate.ps1 malicious payload",
                    "malicious WindowsUpdate.ps1 script"
                ]
            ],
            "infrastructure": [
                [
                    "servers",
                    "one server",
                    "vulnerable servers"
                ],
                [
                    "Windows Temp folder"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-47": {
        "doc": "Microsoft released the March 2019 Office Update today, which consists of 6 security updates and 28 non-security updates. A some of these updates resolve critical vulnerabilities, it is strongly advised that you install them as soon as possible.\n Of the 6 security updates, 4 of them fix remote code execution vulnerabilities within SharePoint and the Microsoft Office Access Connectivity Engine. Remote code execution vulnerabilities are Critical as they could allow attackers to perform almost any command on an exploited computer.\n Also included is an update for Microsoft Office 2016 that allows users to block Access 2016 from executing VBA code if it is identified as being from the Internet.\n \"With this update, you can block Access 2016 from executing Visual Basic for Applications (VBA) code if the file that contains VBA code is identified as being from the Internet.\"\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "Microsoft Office Access Connectivity Engine",
                    "Microsoft Office 2016"
                ],
                [
                    "SharePoint"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-48": {
        "doc": "Windows 10 March 2019 cumulative updates are now rolling out to the compatible devices with fixes and improvements for core components. The update includes both security and non-security improvements and fixes.\n The Patch Tuesday rollout for Windows 10 comprises cumulative updates for all supported versions, including the October 2018 Update (version 1809), but you won't get the update if you are using Creators Update or older with Pro or Home license. Users with Windows 10 Home and Pro license will receive the patches on Windows 10 April 2018 Update and October 2018 Update.\n As always, you can open Settings via Start menu and navigate",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-50": {
        "doc": "Microsoft has released Windows 10 Insider Preview Build 18356 (19H1) to Insiders in the Fast ring. This release is mostly bug fixes, including numerous Night Light bug fixes and a fix for KERNEL_SECURITY_VIOLATION GSODs.\n Along with this release, Microsoft is also introducing the Your Phone app feature called Phone Screen, which allows you to mirror your Android screen on a Windows 10 PC.\n If you are a Windows Insider in the Fast ring, you can update to Windows 10 Insider Preview Build 18356 by going into  Settings ->  Update & Security -> Windows Update and then checking for new updates.\n\n\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-51": {
        "doc": "North Korean backed hacking groups were behind multiple cyberattacks impacting financial institutions and cryptocurrency exchanges as detailed in a report issued by a panel of experts for the United Nations (UN) Security Council.\n According to the report provided by the panel which comes as a confirmation of what security researchers have previously reported, \"cyberspace is used by the DPRK as an asymmetric means to carry out illicit and undercover operations in the field of cybercrime and sanctions evasion. These operations aim to acquire funds through a variety of measures in order to circumvent the  sanctions.\"\n While going through multiple attacks against financial institutions dealing in fiat currency, the report also notes that hackers sponsored by the Democratic People’s Republic of Korea (DPRK) government have also targeted organizations which operate cryptocurrency markets.\n Attacks on cryptocurrency exchanges have made it easier for DPRK-backed hacking groups to avoid being tracked, as well as to launder huge amounts of funds that would then find their way into the hands of the Democratic People’s Republic of Korea.\n Banks and privately-held companies also targeted\nThe UN report states that \"According to one estimate, the Democratic People’s Republic of Korea carried out at least five successful attacks against cryptocurrency exchanges in Asia between January 2017 and September 2018, resulting in a total loss of $571 million.\"\n",
        "roles": {
            "adversary": [
                [
                    "North Korean backed hacking groups",
                    "the DPRK",
                    "Democratic People’s Republic of Korea (DPRK)",
                    "DPRK-backed hacking groups",
                    "Democratic People’s Republic of Korea"
                ]
            ],
            "capability": [],
            "infrastructure": [
                [
                    "cyberspace"
                ]
            ],
            "victim": [
                [
                    "financial institutions and cryptocurrency exchanges",
                    "cryptocurrency exchanges",
                    "cryptocurrency exchanges in Asia"
                ],
                [
                    "financial institutions dealing in fiat currency"
                ]
            ]
        }
    },
    "bleeping-52": {
        "doc": "French security researcher Robert Baptiste found the API of the 63Red Safe mobile application known as \"Yelp for conservatives\" wide open, with no authentication needed to access and view the data stored within the app's database.\n According to its official description, 63Red Safe is an iOS and Android mobile app designed for \"keeping conservatives safe,\" and to help its users \"Find great restaurants nearby, and see how expensive, how far away, and best of all, whether they are safe for conservatives.\"\n To be more specific, the 63Red Safe app will allow its users to know beforehand if it's safe to wear Make America Great Again (MAGA) apparel when dining at a particular restaurant or when shopping at various locations.\n\n A mobile application is using an API to retrieve information from the company server.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-53": {
        "doc": "Mac users utilizing ESET's endpoint antivirus are advised to update to version 6.4.168.0 as soon as possible in order to mitigate a serious issue that allows attackers to execute arbitrary code on their machines.\n The issue, discovered by Google security researcher Jason Geffner, was caused by the usage of an old library inside ESET's antivirus source code.\n ESET Mac antivirus used vulnerable XML parsing library\n Geffner says vulnerable versions of the ESET Mac antivirus used the POCO XML parser library version 1.4.6p1 from 2013-03-06, which in turn was forked from Expat XML parser library version 2.0.1 from 2007-06-05.\n Recently, security researchers became aware of a vulnerability (CVE-2016-0718) in the Expat library that allowed for remote code execution via malformed XML content.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "ESET's endpoint antivirus",
                    "ESET's antivirus",
                    "ESET Mac antivirus",
                    "ESET Mac antivirus"
                ]
            ],
            "victim": [
                [
                    "Mac users"
                ]
            ]
        }
    },
    "bleeping-54": {
        "doc": "Caching servers commonly deployed with big-name services will often cache the incorrect page content, including personal details, when the user accesses a non-existent resource, such as CSS or JavaScript files.\n This issue, nicknamed a \"web cache deception attack,\" was discovered by Israeli security researcher Omer Gil, who says it affects many online services.\n Three services affected, possibly more\nGil, who works as an information security team leader at EY Hacktics Advanced Security Center in Tel Aviv, says he already contacted three major companies affected by the issue.\n All three companies fixed their issues. PayPal is one of the three, while the other two asked the researcher to refrain from publishing their name.\n Bleeping Computer has reached out to Gil and inquired if the attack vector he discovered is a widespread issue among today's web services.\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "\"web cache deception attack,\"",
                    "attack vector"
                ]
            ],
            "infrastructure": [
                [
                    "as CSS or JavaScript files"
                ]
            ],
            "victim": [
                [
                    "the user"
                ],
                [
                    "big-name services",
                    "Three services affected",
                    "three major companies",
                    "the three"
                ],
                [
                    "PayPal"
                ]
            ]
        }
    },
    "bleeping-55": {
        "doc": "Millions of small websites, app backends, and various high-profile services are offline or experiencing severe issues because of a mysterious problem that hit Amazon's S3 (Simple Storage Service) a few hours ago.\n Current reports indicate that a large number of services have been affected and are completely offline. Many other services and websites are also loading very slowly, while others services report that multimedia content doesn't load at all, mainly because it was hosted on S3.\n The list of affected AWS customers includes many of Adobe's apps and services, Docker, Giphy, Grammarly, Hacker News, IFTTT, Imgur, Mailchimp, Medium, Quora, Signal, Slack, Trello, Twilio, Twitch, and countless of smaller apps and websites.\n\n We are experiencing an outage from our service provider, @awscloud - please be patient as we await their resolution.\n — MyFootballNow.com (@MyFootballNow) February 28, 2017\n\n\n\n\nImgur website returning blank web page\n\n\n\n\n\n\n\n504 error on Quora\n\n\n\n\n\n\n\nError message on Grammarly\n\n\n\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-57": {
        "doc": "Speaking at the Mobile World Congress in Barcelona, Spain, new FCC chairman Ajit Pai has expressed his views on net neutrality once again, calling the 2015 legislation a \"mistake.\"\n Pai, who was a member of the US Federal Communications Commission (FCC) since 2012, and named Chairman in January 2017 after President Donald Trump took office, was always against net neutrality, also known as the Open Internet Order, approved by the FCC under the Obama administration in 2015.\n The order classifies net neutrality as a core utility and mandates that Internet Service Providers (ISPs) must treat every website equally.\n From the beginning, net neutrality was an all-around success with US consumers, but under constant attacks from ISPs, who filed and lost a lawsuit, including an appeal, to take down the FCC's new rules.\n Pai was never for net neutrality\nWith Pai's rise to power, ISPs are set to score a massive win, to the detriment of end consumers.\n Pai, who said that net neutrality's days are \"numbered\" even before assuming office, intends to knock down FCC's 2015 legislation and give ISPs more power into deciding how they deal with traffic.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-59": {
        "doc": "Yesterday Microsoft released Insider Preview Build 15046 for PC to insiders in the fast ring, For the most part, this release is a bug fix with some cosmetic changes. The most notable new feature, though, is the introduction of Application Installation Control, which allows admins to control what types of applications can be installed in Windows.\n With Application Installation Control, Microsoft is trying to lock down how applications can be installed in order to maximize security. With this new feature, users can specify whether they only want to allow the installation of applications if they were downloaded from the Microsoft Store, to just issue a warning if you are installing a non-Store app, or to allow applications to be installed from anywhere. Overall, this is a welcome feature as when enabled it can greatly increase security, while still allowing adminstrators to disable it when installing non-Store apps.\n What’s new in Build 15046\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-60": {
        "doc": "A researcher has discovered what he calls a \"logic vulnerability\" that allowed him to create a Python script that is fully capable of bypassing Google's reCAPTCHA fields using another Google service, the Speech Recognition API.\n The researcher, who goes online only by the name of East-EE, released proof-of-concept code on GitHub.\n ReBreakCaptcha vulnerability still unpatched\nEast-EE has named this attack ReBreakCaptcha, and he says he discovered this vulnerability in 2016. Today, when he went public with his research, he said the vulnerability was still unpatched.\n The researcher was not clear if he reported the bug to Google.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "\"logic vulnerability\"",
                    "ReBreakCaptcha vulnerability",
                    "ReBreakCaptcha",
                    "this vulnerability",
                    "the vulnerability"
                ]
            ],
            "infrastructure": [
                [
                    "reCAPTCHA fields"
                ],
                [
                    "another Google service",
                    "the Speech Recognition API"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-61": {
        "doc": "Google said today that starting March 31, 2017, Safe Browsing will show a special message if the user is attempting to download software known to modify Google Chrome settings, or attempting to inject ads in the user's browsing experience.\n According to Google, the Chrome settings changes for which Safe Browsing will show notifications on macOS include the \"manipulation of Chrome user settings, specifically the start page, home page, and default search engine.\"\n Google recently released a special API named the Chrome Settings Overrides API that Mac developers can use when developing apps that interact with Chrome browser settings.\n \"From here on, the Settings Overrides API will be the only approved path for making changes to Chrome settings on Mac OSX, like it currently is on Windows,\" said Google engineers Kylie McRoberts and Ryan Rasti. \" Also, developers should know that only extensions hosted in the Chrome Web Store are allowed to make changes to Chrome settings.\"\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-62": {
        "doc": "The Crypt0L0cker ransomware, otherwise known as Torrentlocker or Teerac, was a common ransomware infection that mostly targeted Australia and European countries in 2014. Towards the middle of 2015, though, this ransomware slowly started dying off to the point that it was hardly distributed anymore.\n Fast forward to the beginning of February 2017 where we are now seeing Crypt0L0cker making a strong come back and targeting European countries once again.\n Crypt0L0cker Campaigns Targeting European Countries\n Over the past few days, I have been receiving a lot of requests for help in decrypting files encrypted by Crypt0L0cker. To see if there was a resurgence in activity, I checked the ID-Ransomware site and saw that towards the end of January Crypt0L0cker went from a small amount of submissions to the their site a day, to close to a 100.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "Crypt0L0cker ransomware",
                    "Crypt0L0cker",
                    "Crypt0L0cker",
                    "Crypt0L0cker",
                    "Crypt0L0cker"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "European countries",
                    "European countries",
                    "European Countries"
                ],
                [
                    "Australia"
                ]
            ]
        }
    },
    "bleeping-63": {
        "doc": "Payment card data of thousands of online shoppers has been stolen at checkout via malicious JavaScript code cybercriminals embedded in seven websites and which continues to collect and deliver the information the crooks.\n Among the websites actively leaking customers' sensitive data to an unauthorized third party is FILA UK, likely since November 2018, when it was compromised.\n Thieving script active on multiple websites\n It is estimated that at least 5,600 shoppers of FILA sportswear had their payment and personal details stolen by now. At the moment, every new customer of the website has the same fate.\n\n Six more websites in the US put their customer's card data at risk just like FILA's UK website.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "malicious JavaScript code cybercriminals embedded",
                    "Thieving script"
                ]
            ],
            "infrastructure": [
                [
                    "sensitive data",
                    "personal details",
                    "customer's card data"
                ],
                [
                    "seven websites",
                    "websites",
                    "multiple websites",
                    "website",
                    "FILA's UK website"
                ]
            ],
            "victim": [
                [
                    "FILA",
                    "FILA",
                    "FILA"
                ],
                [
                    "thousands of online shoppers",
                    "customers",
                    "customer",
                    "customer"
                ]
            ]
        }
    },
    "bleeping-64": {
        "doc": "Massive IMAP-based password-spraying attacks successfully breached Microsoft Office 365 and G Suite accounts, circumventing multi-factor authentication (MFA) according to an analysis by Proofpoint.\n This technique takes advantage of the fact that the legacy authentication IMAP protocol bypasses MFA, allowing malicious actors to perform credential stuffing attacks against assets that would have been otherwise protected.\n As noted by Proofpoint's Information Protection Research Team in a recent report, during a \"recent six-month study of major cloud service tenants, Proofpoint researchers observed massive attacks leveraging legacy protocols and credential dumps to increase the speed and effectiveness of brute force account compromises at scale.\"\n 72% of cloud tenants targeted at least once\n Their analysis unearthed the fact that around 60% of all Microsoft Office 365 and G Suite tenants have been targeted using IMAP-based password-spraying attacks and, as a direct result, approximately 25% of G Suite and Office 365 tenants that were attacked also experienced a successful breach. \n",
        "roles": {
            "adversary": [
                [
                    "allowing malicious actors"
                ]
            ],
            "capability": [
                [
                    "legacy authentication IMAP protocol"
                ],
                [
                    "credential dumps"
                ],
                [
                    "IMAP-based password-spraying"
                ]
            ],
            "infrastructure": [
                [
                    "Microsoft Office 365 and G Suite accounts",
                    "Microsoft Office 365 and G Suite",
                    "G Suite and Office 365"
                ],
                [
                    "multi-factor authentication (MFA)",
                    "MFA"
                ]
            ],
            "victim": [
                [
                    "cloud tenants"
                ],
                [
                    "Microsoft Office 365 and G Suite tenants",
                    "G Suite and Office 365 tenants"
                ]
            ]
        }
    },
    "bleeping-65": {
        "doc": "A large database with approximately 33 million profiles for people seeking jobs in China has been fully accessible and unprotected online. This information included sensitive information that could have been used for scammers and identity theft.\n The database was discovered by Sanyam Jain, a security researcher and member of GDI.Foundation, who found the database using the Shodan search engine.\n Work and salary info exposed online\n The 57GB Elasticsearch database contains the profiles of users in China who uploaded their resume and personal information to job recruitment sites. \n The exposed data included a job seeker's username, gender, age, current city, home address, email address, phone number, marriage status, job history, education history, and salary history.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "sensitive information"
                ],
                [
                    "personal information"
                ]
            ],
            "victim": [
                [
                    "people seeking jobs in China",
                    "profiles of users in China",
                    "job seeker"
                ]
            ]
        }
    },
    "bleeping-67": {
        "doc": "MGM Studios\n Like a modern day WarGames, students in Michigan have hacked into a school district's computer system and changed grades and attendance records.\n According to a statement made on Facebook and the district's web site, Jim Nielsen, the superintendent of Orchard View Schools, stated that they became aware of a data breach in their PowerSchool student information system last week.\n\n Post to school's Facebook page\n When the data breach was discovered, the school launched an investigation and discovered that unauthorized changes to student's grades and attendance records were made. The statement further states that this breach \"appears to be limited to the high school.\"\n",
        "roles": {
            "adversary": [
                [
                    "students in Michigan"
                ]
            ],
            "capability": [],
            "infrastructure": [
                [
                    "grades and attendance records",
                    "student's grades and attendance records"
                ],
                [
                    "school district's computer system",
                    "PowerSchool student information system"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-68": {
        "doc": "Google added a new Admin console option for G Suite admins designed to help them disable telephony options as two-factor authentication (2FA) methods for G Suite accounts in their domain, preventing users from using SMS and voice codes when authenticating.\n According to a G Suite Help Center support document, 2FA—also known as 2-Step Verification (2SV)—\"requires users to verify their identity through something they know (such as a password) plus something they have (such as a physical key or access code delivered to a device). It’s also called multi-factor authentication (MFA) or 2-factor authentication (2FA). \"\nOnce enabled for an account, 2FA (configured to work with text/voice message codes, the Google Authenticator app, or with hardware second factors like security keys) will protect it from unauthorized access by creating an extra defense designed to block malicious actors from logging in using stolen credentials.\n SMS and voice 2FA considered insecure\n \"Cybercriminals are increasingly targeting small businesses.",
        "roles": {
            "adversary": [
                [
                    "malicious actors"
                ]
            ],
            "capability": [
                [
                    "stolen credentials"
                ]
            ],
            "infrastructure": [
                [
                    "Admin console option"
                ],
                [
                    "SMS and voice codes",
                    "text/voice message codes",
                    "SMS and voice 2FA"
                ],
                [
                    "2FA",
                    "2-Step Verification (2SV)—\"requires",
                    "multi-factor authentication (MFA)",
                    "2-factor authentication (2FA)",
                    "2FA",
                    "2FA"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-69": {
        "doc": "Medical IoT (IoMT) devices are left exposed to attacks because of outdated or legacy operating systems which, in many cases, are very easy to hack into and expose a throve of sensitive patient data, highly sought over on the black market.\n In one instance, researchers from Check Point Research were able to find an ultrasound machine running a Windows 2000 OS which no longer receives security patches, leaving the machine vulnerable to a multitude of attacks.\n The researchers demonstrated that, after infiltrating the ultrasound device by exploiting one of the vulnerabilities that impacted it, potential attackers could download the patient records stored within, edit and replace data on the machine, as well as infect it with ransomware allowing them to request a ransom to be paid to restore the medical data.\n\n While this is just a single example of what threat actors can do if they gain access to IoMT devices that use legacy operating systems with numerous and easy to exploit vulnerabilities, it definitely shows the significant damages which attacks targeting health-related data can inflict.\n Just last year, the UK Department of Health and Social Care announced that all National Health Service (NHS) computer systems will be transitioned to Windows 10 following more than a third of all NHS trusts being hit by WannaCry, with the attacks leading to the cancelation of roughly 7,000 medical appointments across the UK—including critical operations.\n Medical data was also the target of threat actors which managed to breach the IT systems of Singapore's Ministry of Health (MOH) and steal the data of approximately 1.5 million citizens.\n",
        "roles": {
            "adversary": [
                [
                    "potential attackers",
                    "threat actors",
                    "threat actors"
                ]
            ],
            "capability": [
                [
                    "ransomware"
                ],
                [
                    "WannaCry"
                ]
            ],
            "infrastructure": [
                [
                    "sensitive patient data",
                    "data",
                    "data",
                    "health-related data",
                    "Medical data",
                    "data of approximately 1.5 million citizens"
                ],
                [
                    "Medical IoT (IoMT) devices",
                    "IoMT devices"
                ],
                [
                    "Windows 10"
                ],
                [
                    "Windows 2000 OS"
                ],
                [
                    "IT systems"
                ]
            ],
            "victim": [
                [
                    "UK Department of Health and Social Care"
                ],
                [
                    "Singapore's Ministry of Health (MOH)"
                ],
                [
                    "1.5 million citizens"
                ]
            ]
        }
    },
    "bleeping-70": {
        "doc": "In a support document posted this month, NVIDIA has stated that they will no longer support 3D Vision in GeForce Game Ready drivers after the upcoming April 2019 Release 418 driver.\n 3D Vision is NVIDIA's is a gaming technology that utilizes software drivers and 3D glasses to play Direct3D games and watch TV in 3D.\n NVIDIA has stated that the Release 418 driver coming in April 2019 will be the last driver to support NVIDIA 3D Vision. After the April release, NVIDIA will no longer include support for 3D Vision, but will continue supporting any critical driver issues that arise in Release 418 through April 2020.\n\n \"Following the posting of the final driver from Release 418 in April 2019, GeForce Game Ready Drivers will no longer support NVIDIA 3D Vision,\" stated NVIDIA's support document. \"The NVIDIA support team will continue to address critical driver issues for 3D Vision in Release 418 through April, 2020.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": [
                []
            ]
        }
    },
    "bleeping-71": {
        "doc": "Windows 10 will automatically uninstall Windows updates that cause startup failures due to incompatibility or issues in new software according to a support document published by Microsoft today.\n As detailed by Microsoft:\n\nThis new feature is only available for Windows Insiders running Windows 10 Insider Preview, build 18351 or later. This version of Windows 10 has not yet been released publicly. \n\n Windows updates will be automatically removed when Windows detects that it has recovered from a startup failure after all other \"automatic recovery attempts have been unsuccessful.\"\n In addition, as a countermeasure for future issues caused by the uninstalled updates, Windows will also blacklist them from installing during the next 30 days.\n According to Microsoft:\nTo ensure that your device can start up and continue running as expected, Windows will also prevent problematic updates from installing automatically for the next 30 days.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": [
                []
            ]
        }
    },
    "bleeping-72": {
        "doc": "A new Ransomware-as-a-Service called Yatron is being promoted on Twitter that plans on using the EternalBlue and DoublePulsar exploits to spread to other computer on a network. This ransomware will also attempt to delete encrypted files if a payment has not been made in 72 hours.\n BleepingComputer was first notified about the Yatron RaaS by a security researcher who goes by the name A Shadow. Since then, the actor behind this ransomware has strangely been promoting the service by tweeting to various ransomware and security researchers as shown below.\n\n Tweet from Ransomware Developer\n After seeing one of these tweets, BleepingComputer was able to find a sample on VirusTotal and with the help of Michael Gillespie, we started to examine the source code of the ransomware. \n",
        "roles": {
            "adversary": [
                [
                    "actor behind this ransomware"
                ]
            ],
            "capability": [
                [
                    "EternalBlue"
                ],
                [
                    "DoublePulsar"
                ],
                [
                    "Ransomware-as-a-Service",
                    "Yatron",
                    "Yatron RaaS",
                    "this ransomware",
                    "the service",
                    "the ransomware"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-73": {
        "doc": "The Oregon Department of Human Services (DHS) announced that roughly 2 million emails with Protected Health Information (PHI) from more than 350,000 customers have been potentially exposed after 9 employee mailboxes were compromised in a spear phishing attack.\n According to the Oregon DHS, its Enterprise Security Office Cyber Security team was the one which determined that the email boxes were breached on January 28, 2019.\n DHS also said that the attackers were stopped from further accessing the hacked mailboxes by resetting the passwords and that an investigation was started to review all the information that might have been exposed, as well as to pinpoint the exact \"number of impacted records that might contain personal information of clients receiving services from DHS.\"\n Forensic review of the data breach ongoing\nAfter the attack was successfully stopped, \"The agency has hired an outside entity, IDExperts, to perform a forensic review to clarify the number and identities of Oregonians whose information was exposed, and the specific kinds of information involved.\"\n DHS states that the PHI impacted in the data breach \"was accessible to an unauthorized person\" and that the information \"may include first and last names, addresses, dates of birth, Social Security numbers, case number and other information used to administer DHS programs.\"\n Also, \"The department cannot confirm that any clients’ personal information was acquired from its email system or used inappropriately.",
        "roles": {
            "adversary": [
                [
                    "attackers"
                ]
            ],
            "capability": [
                [
                    "spear phishing attack"
                ]
            ],
            "infrastructure": [
                [
                    "2 million emails ",
                    "email boxes",
                    "email system"
                ],
                [
                    "Protected Health Information (PHI)",
                    "PHI"
                ],
                [
                    "personal information of clients"
                ]
            ],
            "victim": [
                [
                    "Oregon Department of Human Services (DHS)",
                    "Oregon DHS",
                    "DHS",
                    "DHS",
                    "DHS",
                    "DHS"
                ],
                [
                    "350,000 customers",
                    "clients receiving services from DHS",
                    "clients"
                ]
            ]
        }
    },
    "bleeping-74": {
        "doc": "During the second day of Pwn2Own Vancouver 2019, competitors successfully pwned the Mozilla Firefox and Microsoft Edge web browsers, as well as VMware's Workstation client, earning a total of $270,000 in cash awards.\n As part of the first event, the Fluoroacetate team targeted and successfully exploited Mozilla's Firefox web browser with a kernel escalation using a JIT bug and an out-of-bounds write in the Windows kernel.\n The same team also tried their hand against Microsoft's Edge web browser with a VMware escape and a kernel escalation, using an exploit chain combining \"a type confusion in Edge, a race condition in the windows kernel, and an out-of-bounds write in VMware Workstation.\n They started from within the VMware Workstation client and visited a specially crafted web page using Microsoft Edge to escape the VM and execute code on the hypervisor.\n The two exploitation demos earned Fluoroacetate $180,000 during the second day, which, combined with their previous $160,000 earnings from the previous day, brings them to a total of $340,000.\n\n Niklas Baumstark also targeted Mozilla's Firefox web browser and successfully hacked it using a JIT bug chained with a logic bug to escape the browser's sandbox, earning $40,000 in the process.\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "kernel escalation",
                    "kernel escalation"
                ],
                [
                    "exploit chain"
                ],
                [
                    "kernel escalation"
                ]
            ],
            "infrastructure": [
                [
                    "Microsoft Edge web browsers",
                    "Microsoft's Edge web browser",
                    "Microsoft Edge"
                ],
                [
                    "VMware's Workstation client",
                    "VMware Workstation",
                    "VMware Workstation client",
                    "the VM"
                ],
                [
                    "Mozilla Firefox",
                    "Mozilla's Firefox web browser",
                    "Mozilla's Firefox web browser"
                ],
                [
                    "browser's sandbox"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-75": {
        "doc": "WordPress websites using unpatched Social Warfare installations (v3.5.1 and v3.5.2) are exposed to attacks abusing a stored Cross-Site Scripting (XSS) vulnerability fixed in the 3.5.3 version of the plugin.\n After it was determined that the vulnerable plugin which currently has more than 70,000+ installations was actively exploited in the wild, Social Warfare was removed from the WordPress plugin store and was later added back after the development team issued a patch to fix for the zero-day.\n This vulnerability is especially dangerous since it allows remote unauthenticated attackers to execute JavaScript code stored in the database of WordPress websites that use the Social Warfare plugin in the browsers of all website visitors.\n As explained by Mikey Veenstra, Wordfence threat analyst, \"The flaw allows attackers to inject malicious JavaScript code into the social share links present on a site’s posts.\"\n\n PSA: The #WordPress plugin Social Warfare contains an unpatched zero-day flaw which is under active attack in the wild. @wordfence premium users have access to the WAF rule we've released, others should deactivate the plugin ASAP until a patch is released.",
        "roles": {
            "adversary": [
                [
                    "unauthenticated attackers",
                    "attackers"
                ]
            ],
            "capability": [
                [
                    "JavaScript code stored in the database of WordPress websites",
                    "malicious JavaScript code"
                ]
            ],
            "infrastructure": [
                [
                    "unpatched Social Warfare installations",
                    "Social Warfare",
                    "Social Warfare",
                    "WordPress plugin Social Warfare"
                ],
                [
                    "WordPress websites",
                    "WordPress websites"
                ]
            ],
            "victim": [
                [
                    "website visitors"
                ]
            ]
        }
    },
    "bleeping-76": {
        "doc": "In a new feature tracking post for the Microsoft's Calculator GitHub project, Microsoft has stated that they plan on adding a graphing mode to the Windows 10 calculator.\n One of the core components of mathematics is algebra, which includes solving equations that utilize letters to represent unknown number or numbers. The solutions to these equations can then be plotted on a graph in order to illustrate their relationships.\n According to Dave Grochocki, a Senior Program Manager at Microsoft, Microsoft plans on adding a graphing mode to the Windows 10 Calculator in order to better aid students who are learning how to graph in algebra.\n \"High school algebra is the gateway to mathematics and all other disciplines of STEM. However, algebra is the single most failed course in high school, as well as the most failed course in community college (Washington Post).",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": [
                []
            ]
        }
    },
    "bleeping-77": {
        "doc": "This week has been dominated by the news of aluminum producer Norsk Hydro being crippled by the LockerGoga Ransomware. Since then, it has been constant news coverage regarding the ransomware and more in-depth analysis.\n It should be noted that while this ransomware has had high profile targets, it is not the most active one out there targeting companies and has not seen wide distribution. Furthermore, it's very noisy as it consumes a lot of CPU, causes explorer to crash repeatedly, and borks the system enough while encrypting that you can't run normal programs. Unless its launched on an idle machine, it would have a good chance of being spotted.\n Other than that, it is has been mostly new variants of old ransomware released this week and a new ransomware called JNEC.a that was distributed via the WinRAR ACE vulnerability.\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "LockerGoga Ransomware",
                    "the ransomware",
                    "this ransomware"
                ],
                [
                    "new variants of old ransomware"
                ],
                [
                    "new ransomware called JNEC.a"
                ]
            ],
            "infrastructure": [
                [
                    "CPU"
                ],
                [
                    "WinRAR ACE vulnerability"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-78": {
        "doc": "Beazley Breach Response (BBR) Services found that 71% of ransomware attacks targeted small businesses, with an average ransom demand of $116,324 and a median of $10,310, after analyzing 3,300 incidents involving its clients in 2018.\n As further detailed by Beazley's 2019 Breach Briefing report, the highest ransom demanded from its insureds was of $8.5 million or 3,000 Bitcoin, while the highest ransom paid by one of its clients was of $935,000.\n Small-to-medium sized companies were the most sought over targets because they will usually spend a lot less on securing their computing systems and information than larger firms according to the report, making it a lot easier for malicious actors to compromise their systems.\n Out of all SMBs impacted by ransomware, the ones \"that do not lockdown Remote Desktop Protocol (RDP) are at higher risk of being attacked\" according to Beazley, a group of global insurance professionals.\n As reported by BleepingComputer during October 2018, there's also a ransomware family dubbed CommonRansom which will actually ask victims to provide RDP access with admin credentials to the locked computers to decrypt the encrypted files. \n\n\n",
        "roles": {
            "adversary": [
                [
                    "malicious actors"
                ]
            ],
            "capability": [
                [
                    "CommonRansom"
                ]
            ],
            "infrastructure": [
                [
                    "Remote Desktop Protocol (RDP)"
                ],
                [
                    "admin credentials"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-79": {
        "doc": "Source: Andrea Booher/FEMA\n\n\nThe Office for the Inspector General for the DHS issued a report today that detailed how FEMA did not appropriately safeguard the personal information of 2.3 million survivors of hurricanes Harvey, Irma, and Maria and the California wildfires in 2017.\n During national disasters, the Federal Emergency Management Agency’s (FEMA) offers a program called Transitional Sheltering Assistance (TSA) that provides shelter to disaster survivors. \n In an advisory titled \"Management Alert – FEMA Did Not Safeguard Disaster Survivors’ Sensitive Personally Identifiable Information\", it is disclosed that FEMA did not appropriately safeguard personal information of survivors, including bank account information, and provided it to a contractor managing the program.\n \"During our ongoing audit of the Federal Emergency Management Agency’s (FEMA) Transitional Sheltering Assistance (TSA) program, we determined that FEMA violated the Privacy Act of 19741 and Department of Homeland Security policy2 by releasing to [redacted] the PII and SPII of 2.3 million survivors of hurricanes Harvey, Irma, and Maria and the California wildfires in 2017.3 FEMA should only provide [redacted] with limited information needed to verify disaster survivors’ eligibility for the TSA program.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "FEMA",
                    "FEMA",
                    "Federal Emergency Management Agency’s (FEMA)",
                    "FEMA",
                    "FEMA",
                    "Federal Emergency Management Agency’s (FEMA)",
                    "FEMA",
                    "FEMA"
                ],
                [
                    "the PII and SPII"
                ],
                [
                    "personal information",
                    "personal information"
                ]
            ],
            "victim": [
                [
                    "2.3 million survivors of hurricanes Harvey, Irma, and Maria and the California wildfires",
                    "disaster survivors",
                    "Disaster Survivors",
                    "survivors",
                    "2.3 million survivors",
                    "disaster survivors"
                ]
            ]
        }
    },
    "bleeping-81": {
        "doc": "A new deal is available for more than 95% off The AWS Certification Training Master Class Bundle.\n This deal is for a bundle that contains 9 courses and over 50 hours of training for various AWS certifications. This bundle normally has a value of $1,447, but has been discounted 95% to $59 as part of this deal. \n Please note that exam vouchers are not included with this deal.\n If AWS certifications are not what you are looking for, we also have a The Docker and Kubernetes Certification Training Bundle for $15.99 and a CompTIA IT Certification Bundle for $49.\n BUNDLED COURSES:\n\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-83": {
        "doc": "The WordPress team fixed a software flaw introduced in the 5.1 release that could allow potential attackers to perform stored cross-site scripting (XSS) attacks with the help of maliciously crafted comments on WordPress websites with the comments module enabled.\n The vulnerability patched in WordPress 5.1.1 would make it possible for bad actors to take over websites using a cross-site request forgery (CSRF) vulnerability by luring a logged on administrator into visiting a malicious website containing an XSS payload.\n Next, the XSS payload is loaded and executed with the help of a hidden iFrame, allowing unauthenticated attackers to execute arbitrary HTML and script code, potentially taking over the vulnerable WordPress websites attacked. \n \"The CSRF exploit abuses multiple logic flaws and sanitization errors that when combined lead to Remote Code Execution and a full site takeover,\" according to RIPS Technologies.\n\n #WARNING: New critical #Wordpress vulnerability found!",
        "roles": {
            "adversary": [
                [
                    "potential attackers",
                    "bad actors",
                    "unauthenticated attackers"
                ]
            ],
            "capability": [
                [
                    "arbitrary HTML and script code"
                ],
                [
                    "Remote Code Execution"
                ],
                [
                    "XSS payload",
                    "XSS payload"
                ],
                [
                    "CSRF exploit"
                ]
            ],
            "infrastructure": [
                [
                    "WordPress websites",
                    "websites",
                    "vulnerable WordPress websites"
                ],
                [
                    "malicious website"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-84": {
        "doc": "Servers controlled by Chinese IT and services giant Hangzhou Shunwang Technology collect phone contact lists, geolocation, and QQ messenger login info through a data-stealing component present in up to a dozen Android apps available from major third-party stores in the country.\n The code that steals the information hides in a data analytics Software Development Kit (SDK) integrated into seemingly benign apps and delivers the scraped details whenever the phone reboots or the infected app starts.\n Researchers believe that gathering end users' contact lists is likely to happen without app developers knowing about it.\n\n Most of the apps are system utilities and can be installed from big-name app stores in China such as Tencent MyApp, Wandoujia, Huawei App Store, and Xiaomi App Store. The compromised apps have been downloaded at least 111 million times. Some of the developers seem to be connected to Shunwang Technology because their apps are published only on the company's website.\n",
        "roles": {
            "adversary": [
                [
                    "Chinese IT and services giant Hangzhou Shunwang Technology",
                    "Shunwang Technology",
                    "the company"
                ]
            ],
            "capability": [],
            "infrastructure": [
                [
                    "data analytics Software Development Kit (SDK)"
                ],
                [
                    "Xiaomi App Store"
                ],
                [
                    "Wandoujia"
                ],
                [
                    "QQ messenger login info"
                ],
                [
                    "dozen Android apps",
                    "compromised apps"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-86": {
        "doc": "A Chinese threat group was using hacking tools developed by the NSA more than a year before Shadow Brokers leaked them in April 2017, tools that were later used in highly destructive attacks such as the WannaCry ransomware campaign from May 2017.\n The Buckeye threat group (also known to researchers as Gothic Panda, TG-0110, UPS, and APT3) has been active since at least 2010, it is credited by experts for running Operation Clandestine Fox, Operation Clandestine Wolf, and Operation Double Tap [1, 2, 3], and for mainly attacking U.S. entities with a sudden switch to Hong Kong targets back in 2015.\n The indictment of three APT3 members by the U.S. government in November 2017 is the thing that really brought the group in the spotlight, with the three Chinese hackers being accused of infiltrating the computing systems of Moody’s Analytics, Siemens, and Trimble between 2011 and May 2017.\n As unearthed by Symantec, the Chinese-backed Buckeye was using NSA hacking tools 13 months before they were leaked by Shadow Brokers—the hacking group who stole them—in April 2017, together with a \"previously unknown Windows zero-day vulnerability that Symantec discovered (which has since been patched by Microsoft).\"\n\n Starting with March 2016, the NSA DoublePulsar backdoor was detected as part of Buckeye campaigns, while being dropped with the help of the Bemstour Trojan, a malware dropper specifically created by the group to deliver the NSA malware payload.\n Symantec discovered that the variant used by Buckeye during their attacks was newer than the one leaked by Shadow Brokers, with an extra layer of obfuscation which might indicate that the Chinese hackers customized it before deployment on their victims' systems.\n",
        "roles": {
            "adversary": [
                [
                    "NSA",
                    "NSA",
                    "NSA",
                    "NSA"
                ],
                [
                    "Chinese-backed Buckeye"
                ],
                [
                    "Chinese threat group was",
                    "Buckeye threat group",
                    "APT3",
                    "APT3",
                    "Buckeye campaigns",
                    "the group",
                    "Buckeye"
                ],
                [
                    "Chinese hackers being",
                    "Chinese hackers"
                ],
                [
                    "Shadow Brokers",
                    "hacking group"
                ]
            ],
            "capability": [
                [
                    "Operation Clandestine Fox"
                ],
                [
                    "Windows zero-day vulnerability"
                ],
                [
                    "NSA DoublePulsar backdoor"
                ],
                [
                    "Bemstour Trojan",
                    "a malware dropper"
                ],
                [
                    "NSA malware payload"
                ],
                [
                    "WannaCry ransomware"
                ]
            ],
            "infrastructure": [],
            "victim": [
                [
                    "U.S. entities"
                ],
                [
                    "Symantec",
                    "Symantec"
                ]
            ]
        }
    },
    "bleeping-87": {
        "doc": "During the Microsoft Build 2019 Keynote yesterday, we were shown a brief glimpse of the new Microsoft Edge running on macOS. In a blog post released in conjunction with MS Build, Microsoft stated that the macOS version would be released soon.\n \"If you’re not on Windows 10,\" stated Microsoft in a blog post, \"don’t worry―we’re looking forward to sharing builds for macOS and previous versions of Windows soon.\"\n As always happens after Microsoft announces an upcoming software release, Windows sleuths search for and have found ways to download and install the macOS version before it is fully released.\n\n\n Below we take a look at the Microsoft Edge browser on Mac.\n First look at Microsoft Edge on Mac\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-88": {
        "doc": "An unprotected Elasticsearch cluster found via a Shodan search exposed 37,900 records of Kool King Shop customers, a French online shop specifically tailored to be used by kids who bought Burger King menus.\n As Security Discovery researcher Bob Diachenko discovered after further investigation, the data was leaked because the database storing it was misconfigured, allowing anyone with an Internet connection and the knowledge to find it to get to the records stored within.\n Since the database was not secured in any way and publicly accessible, anyone who reached it could then edit, download, or even destroy the data without needing admin credentials.\n\n Leaked database\n As the researcher also unearthed, the databases contained plain text data which was left out in the open since at least April 24, according to Shodan historical data.\n The 37,900 Kool King Shop member records contained personally identifiable information (PII) such as \"emails, passwords (access to the portal), names, phones, DOB, voucher codes, links to the externally stored certificates, etc.\"\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "37,900 records"
                ],
                [
                    "data",
                    "the database",
                    "the database",
                    "data",
                    "Leaked database",
                    "the databases"
                ],
                [
                    "emails"
                ]
            ],
            "victim": [
                [
                    "Kool King Shop customers",
                    "37,900 Kool King Shop member"
                ]
            ]
        }
    },
    "bleeping-89": {
        "doc": "Canonical has released a new Linux Intel microcode update for Ubuntu that fixes an issue causing Intel Skylake CPUs to hang after a warm reboot.\n On November 12th, 2019, new Intel microcodes were released to mitigate a vulnerability discovered in the Transactional Synchronization Extensions (TSX) feature in Intel processors and a vulnerability in Intel Xeon processors that could lead to a denial of service attack from a local privileged user.\n \"Intel processors using Transactional Synchronization Extensions (TSX) could expose memory contents previously stored in microarchitectural buffers to a malicious process that is executing on the same CPU core. A local attacker could use this to expose sensitive information. \"\n After the update was released, a regression was discovered that was causing Intel Skylake processors to hang after a warm reboot.\n To resolve this issue, Ubuntu has released the new 'intel-microcode - 3.20191115.1ubuntu0' that reverts the microcodes for Skylake processors so that they no longer freeze.  \n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "denial of service"
                ]
            ],
            "infrastructure": [
                [
                    "Linux Intel microcode"
                ],
                [
                    "vulnerability in Intel Xeon processors"
                ],
                [
                    "Transactional Synchronization Extensions (TSX"
                ],
                [
                    "CPU core"
                ],
                [
                    "sensitive information"
                ],
                [
                    "'intel-microcode - 3.20191115.1ubuntu0'"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-93": {
        "doc": "Netography, a self-governing network security platform designed to function as an enterprise security crow's nest received today $2.6 million in funding from Andreessen Horowitz as part of its seed round.\n The startup company strives to allow security and network teams to work smarter by taking advantage of the huge quantities of real-time data network devices generate on a regular basis to automatically identify and block malicious traffic as a network defense measure.\n More exactly, Netography implements an autonomous network security mechanism and telemetry tools that make it possible to stop security threats which usually go unnoticed.\n Also, it makes it possible to convert a standard network into an intelligently self-correcting system with the help of a global infrastructure seamless view paired with advanced threat detection algorithms which also react automatically with the proper counter-measures.\n Lyon previously founded Prolexic, acquired by Akamai\n“After years of studying the evolving landscape, and building so many platforms, we realized the answer was right in front of us,” said Barrett Lyon, CEO of Netography.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "Netography",
                    "self-governing network security platform",
                    "Netography",
                    "it",
                    "it",
                    "Netography"
                ],
                [
                    "standard network"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-94": {
        "doc": "A new deal is available for more than 93% off The Oracle Professional Certification Training Bundle.\n This deal is for a 2 course bundle with 24 hours of preparation for the Oracle SQL Fundamentals: 12c OCP 1Z0-061 and Oracle Database 12c Administration 1Z0-062 certifications.  These courses normally have a combined value of $924, but have been discounted more than 93% to $59 as part of this deal. \n It should be noted that this bundle does not include vouchers for the exam.\n If Oracle is not what you are looking for, we also have a CompTIA IT Certification Bundle for $49 that helps prepare you for the CompTIA A+, CompTIA Network+, Security+ certifications.\n BUNDLED COURSES:\n\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-95": {
        "doc": "Microsoft announced the addition of live response capabilities to its Microsoft Defender Advanced Threat Protection (Microsoft Defender ATP) enabling security operation teams to perform system forensic analysis remotely.\n Microsoft Defender ATP is a security platform designed to allow security teams to provide \"preventative protection, post-breach detection, automated investigation, and response.\"\n The new live response added to Microsoft Defender ATP gives instant remote access to any enterprise computer for faster forensic analysis and forensic information collection, regardless of its actual location.\n\n Live response remediation commands\n More to the point, the new capability allows security professionals to get \"access to a machine using a remote shell connection. This gives you the power to do in-depth investigative work and take immediate response actions to promptly contain identified threats – real-time.\"\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "Microsoft Defender Advanced Threat Protection (Microsoft Defender ATP)",
                    "Microsoft Defender ATP",
                    "Microsoft Defender ATP"
                ],
                [
                    "system forensic analysis"
                ],
                [
                    "remote shell connection"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-96": {
        "doc": "Four new vulnerabilities have been discovered in Intel processors that can be exploited via speculative execution side-channel attacks called RIDL, Fallout, and ZombieLoad.\n These vulnerabilities allow attackers to steal passwords, cryptographic keys, or any other type of data to be loaded or stored in the memory of the CPU buffers.\n The vulnerabilities are being categorized as Microarchitectural Data Sampling (MDS) speculative execution vulnerabilities and are associated with the four uniquely identifiable CVEs below:\n\nCVE-2018-12126 - Microarchitectural Store Buffer Data Sampling (MSBDS)\nCVE-2018-12130 - Microarchitectural Fill Buffer Data Sampling (MFBDS)\n CVE-2018-12127 - Microarchitectural Load Port Data Sampling (MLPDS)\nCVE-2019-11091 - Microarchitectural Data Sampling Uncacheable Memory (MDSUM)\n\n For more information on how these vulnerabilities work, who discovered them, and how you can test if you are vulnerable, you can read our New RIDL and Fallout Attacks Impact All Modern Intel CPUs article.\n",
        "roles": {
            "adversary": [
                [
                    "attackers"
                ]
            ],
            "capability": [
                [
                    "RIDL"
                ],
                [
                    "ZombieLoad"
                ],
                [
                    "RIDL and Fallout Attacks"
                ]
            ],
            "infrastructure": [
                [
                    "CPU buffers"
                ],
                [
                    "identifiable CVEs",
                    "CVE-2018-12126",
                    "CVE-2018-12130",
                    "CVE-2018-12127",
                    "CVE-2019-11091"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-97": {
        "doc": "If you currently have mitigations enabled for the Spectre Variant 2 (CVE-2017-5715) vulnerability, Microsoft has now enabled the Retpoline Spectre mitigation feature by default in Windows 10 version 1809 (October 2018 Update) for better performance.\n When Microsoft released mitigations for the Spectre vulnerabilities they caused a performance hit on older computers. To provide a better solution, Microsoft had been testing a new mitigation called Retpoline in Windows 10 Insider builds that would protect the computer, but without the negative side effect of decreased performance.\n In March we reported that Microsoft had ported the Retpoline feature to Windows 10 version 1809, but it was not enabled by default. Instead users had to manually enable Retpoline in order to take advantage of this new feature.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "Windows 10 version 1809 (October 2018 Update)",
                    "Windows 10 version 1809"
                ],
                [
                    "Retpoline",
                    "Retpoline",
                    "Retpoline"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-99": {
        "doc": "Update 5/15/19 11:35 PM EST: Google has told us that this issue has been fixed and BleepingComputer has confirmed that the privacy settings now appear on the normal Settings page.\n Update 5/15/19 1:07 PM EST: Google has replied to our questions with the following statement:\n “All users are currently able to access these privacy settings via the ‘Google Payments privacy settings page’ link in the Google Pay privacy notice. The different settings views described here are an issue resulting from a previous software update and we are working to fix this right away so that these privacy settings are always visible on pay.google.com.”\n It has been discovered that Google is hiding three Google Pay privacy settings unless you access the service's Settings screen through a special URL. These settings allow you to restrict whether Google Pay shares your creditworthiness, personal information, or Google Pay account information.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-100": {
        "doc": "Researchers stressing the code related to Qualcomm's implementation of the secure execution area on mobile devices found a new vulnerability that could allow access to critical data.\n Top smartphone brands like Samsung, LG, or Motorola rely on Qualcomm's implementation of the Trusted Execution Environment (TEE)  based on the TrustZone technology from ARM to store and handle sensitive information in a secure area inside the main processor.\n TEE runs at the same time as the Android operating system and executes only trusted code completely shielded from user-installed apps.\n Trusted apps (trustlets) running in TEE are also isolated from each other through software and cryptography; they receive from regular apps outside this space commands for various purposes (fingerprint recognition, decryption, payment).\n Not exactly a low-hanging fruit\nDue to the tight control and restrictions available, access to data in Qualcomm’s “Secure World” is deemed extremely difficult. However, security researchers from Check Point figured out a way to do it.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-101": {
        "doc": "In a letter to the U.S. Congress, Brave urged Homeland Security Committee members to make it mandatory for all federal employees to use a browser that blocks advertising by default. \n Brave states that without a browser that blocks ads by default, federal employees would be vulnerable to malvertising, which could allow foreign and domestic threat actors to gain access to government devices or a foothold in sensitive networks.\n \"I represent Brave, a rapidly growing Internet browser based in San Francisco. Brave’s CEO, Brendan Eich, is the inventor of JavaScript, and co-founded Mozilla/Firefox. Brave is headquartered in San Francisco. I write to urge action to protect federal agency and employee computers and devices from cyberattacks by foreign state actors and criminals through “malvertising”.\"\n",
        "roles": {
            "adversary": [
                [
                    "foreign and domestic threat actors"
                ]
            ],
            "capability": [
                [
                    "malvertising"
                ],
                [
                    "sensitive networks"
                ]
            ],
            "infrastructure": [
                [
                    "government devices"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-102": {
        "doc": "Select Health Network and Solara Medical Supplies disclosed data incidents caused by breaches of their employees' email accounts that lead to exposure of both personally identifiable information (PII) and protected health information (PHI).\n In both cases, the number of individuals who had their information exposed was not disclosed, however current and former members, patients, and, in some cases, employees are known to be affected.\n Select Health and Solara urge potentially affected individuals to remain vigilant against future identity theft or fraud incidents, as well as carefully review their account statements, credit reports, and explanation of benefits forms following these incidents.\n Health network data exposed in breach\n Select Health Network is an Indiana health network from St. Joseph and Marshall Counties, and collaboration between Saint Joseph Health System and 770 health care providers, including 619 specialists and 151 primary care physicians.\n Select Health disclosed on November 13 that one of its employee's email accounts was accessed by a not yet known actor without authorization from May 22, 2019 to June 13, 2019.\n",
        "roles": {
            "adversary": [
                [
                    "not yet known actor"
                ]
            ],
            "capability": [],
            "infrastructure": [
                [
                    "employees' email accounts"
                ],
                [
                    "personally identifiable information (PII)",
                    "protected health information (PHI)"
                ]
            ],
            "victim": [
                [
                    "current and former members"
                ],
                [
                    "Select Health Network",
                    "Indiana health network"
                ]
            ]
        }
    },
    "bleeping-107": {
        "doc": "One Android app with spyware capabilities based on an open-source remote access tool (RAT) has twice thwarted the security of Google Play over a period of two weeks.\n Radio Balouch (or RB Music) included functionality from AhMyth Android RAT, an open-source project software that became public in late 2017. Since its open release, several malicious mobile apps borrowed its code to spy on Android users.\n There's a first for everything\n Until now, there have not been any reports of apps built on AhMyth that enjoyed worldwide distribution through Google Play. This makes Radio Balouch the first in the bunch to bypass Google's app-vetting mechanism and make it into Android's official apps store.\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "open-source remote access tool (RAT)",
                    "AhMyth Android RAT",
                    "an open-source project software",
                    "AhMyth"
                ],
                [
                    "Radio Balouch",
                    "RB Music",
                    "Radio Balouch"
                ]
            ],
            "infrastructure": [
                [
                    "Google's app-vetting mechanism"
                ],
                [
                    "Android's official apps store"
                ]
            ],
            "victim": [
                [
                    "Android users"
                ]
            ]
        }
    },
    "bleeping-108": {
        "doc": "Multiple versions of the Squid web proxy cache server built with Basic Authentication features are currently vulnerable to code execution and denial-of-service (DoS) attacks triggered by the exploitation of a heap buffer overflow security flaw.\n The vulnerability present in Squid 4.0.23 through 4.7 is caused by incorrect buffer management which renders vulnerable installations to \"a heap overflow and possible remote code execution attack when processing HTTP Authentication credentials.\"\n \"When checking Basic Authentication with HttpHeader::getAuth, Squid uses a global buffer to store the decoded data,\" says MITRE's description of the vulnerability. \"Squid does not check that the decoded length isn't greater than the buffer, leading to a heap-based buffer overflow with user controlled data.\"\n The flaw was patched by the web proxy's development team with the release of Squid 4.8 on July 9.\n Some unpatched servers exposed to attacks\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "denial-of-service (DoS)"
                ],
                [
                    "exploitation of a heap buffer overflow security flaw"
                ]
            ],
            "infrastructure": [
                [
                    "Basic Authentication features"
                ],
                [
                    "Squid web proxy cache server",
                    "Squid",
                    "Squid",
                    "Squid",
                    "web proxy",
                    "Squid"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-109": {
        "doc": "Cisco updated the security advisories for three vulnerabilities patched in early August warning customers that its Product Security Incident Response Team (PSIRT) team is aware of public exploit code being available.\n Out of the three flaws impacting the Cisco Small Business 220 Series Smart Switches, two are critical remote code execution (CVE-2019-1913) and authentication bypass security (CVE-2019-1912) issues.\n An unauthenticated, remote attacker could take advantage of them to execute arbitrary code with root privileges and upload arbitrary files, respectively.\n The third one is a command injection vulnerability tracked as CVE-2019-1914 and which could potentially enable authenticated, remote attackers who abuse it to launch a command injection attack.\n As Cisco's updated security advisories explain:\n\nThe Cisco Product Security Incident Response Team (PSIRT) is aware of the existence of public exploit code. Cisco PSIRT is not aware of malicious use of the vulnerability that is described in this advisory.\n\n",
        "roles": {
            "adversary": [
                [
                    "An unauthenticated, remote attacker"
                ]
            ],
            "capability": [
                [
                    "command injection attack"
                ],
                [
                    "critical remote code execution"
                ],
                [
                    "authentication bypass security",
                    "Cisco PSIRT is"
                ]
            ],
            "infrastructure": [
                [
                    "command injection vulnerability"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-110": {
        "doc": "Almost 48 hours after security researcher Vasily Kravets (PsiDragon) released his proof of concept (PoC) for a second vulnerability in Steam client for Windows leading to privilege escalation, Valve released a beta update that allegedly fixes the bugs.\n Quick re-cap:\nKravets and another fellow security researcher Matt Nelson discovered and responsibly reported a local privilege escalation (LPE) vulnerability that Valve dismissed as being out of scope and would do nothing to mitigate or patch it.\n As a result, Matt decided to show how the vulnerability could be exploited and published a PoC where he gets a command prompt window running with SYSTEM account privileges, the highest for a user on Windows.\n Fast forward a few days and Valve published a patch for the vulnerability.  This was not a complete fix, though, and could be easily bypassed; this happened on August 15, when Twitter user Xiaoyin Liu posted that they had found a way around the fix.\n\n I found a way to bypass the fix.",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "privilege escalation"
                ]
            ],
            "infrastructure": [
                [
                    "Steam client for Windows"
                ]
            ],
            "victim": [
                [
                    "Valve",
                    "Valve",
                    "Valve"
                ]
            ]
        }
    },
    "bleeping-112": {
        "doc": "Google is adding a built-in data breach notification service to the Chrome browser that will alert users when they are logging into sites with credentials that have been exposed by breaches.\n With the constant leaks of account credentials from data breaches and the rampant password reuse commonly seen among users, data breach notification services were created to alert users when their email addresses were included in a data breach.\n One of the more popular services is Have I Been Pwned and Mozilla partnered with them to launch a Firefox Monitor service that is being integrated into the Firefox browser.\n Not to be outdone, Google also recently launched a new data breach service through their Chrome Password Checkup browser extension, which when installed would alert users if their user names and passwords were compromised when they log into a site.\n Through the use of the Password Checkup extension, Google conducted a study that estimates 1.5% of all logins have been compromised in data breaches. This study also showed that 26% of users who were shown a data breach notification, changed their password.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "credentials",
                    "account credentials"
                ],
                [
                    "Firefox Monitor"
                ],
                [
                    "Chrome browser",
                    "Firefox browser"
                ],
                [
                    "Password Checkup extension"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-113": {
        "doc": "Command and control (C2) servers for the Emotet botnet appear to have resumed activity and deliver binaries once more. This comes after being inert since the beginning of June.\n Although it started as a banking trojan in 2014, Emotet changed its course to becoming a botnet that delivers various malware strains.\n Emotet is now one of the top threats, its infrastructure being used to distribute Trickbot, another banking trojan, and then spread the Ryuk ransomware. This combination is dubbed 'triple threat' and has affected public administrations in the U.S.\n Emotet break is over\n",
        "roles": {
            "adversary": [],
            "capability": [
                [
                    "Command and control (C2) servers"
                ],
                [
                    "Emotet botnet",
                    "banking trojan",
                    "Emotet",
                    "Emotet",
                    "Emotet"
                ],
                [
                    "malware"
                ],
                [
                    "Trickbot",
                    "another banking trojan"
                ],
                [
                    "Ryuk ransomware"
                ]
            ],
            "infrastructure": [],
            "victim": []
        }
    },
    "bleeping-114": {
        "doc": "Instagram users are currently targeted by a new phishing campaign that uses login attempt warnings coupled with what looks like two-factor authentication (2FA) codes to make the scam more believable.\n Crooks use phishing to trick potential victims into handing over sensitive information via fraudulent websites they control with the help of a wide range of social engineering techniques, as well as messages designed to look like they're sent by someone they know or a legitimate organization.\n In this case, the phishing e-mails distributed by the attackers behind this campaign use fake Instagram login alerts stating that someone attempted to log in to the target's account, asking them to confirm their identity via a sign-in page linked within the message.\n Authentication codes used to add legitimacy\n These messages are designed to look as close as possible to what official messages coming from Instagram to avoid raising any suspicions before the target is redirected to the attackers' phishing landing page.\n \"Apart from a few punctuation errors and the missing space before the word ‘Please’, this message is clean, clear and low-key enough not to raise instant alarm bells,\" details Sophos' Paul Ducklin who analyzed the campaign.\n",
        "roles": {
            "adversary": [
                [
                    "attackers",
                    "attackers"
                ]
            ],
            "capability": [
                [
                    "social engineering"
                ],
                [
                    "phishing",
                    "phishing",
                    "phishing e-mails",
                    "phishing landing page"
                ]
            ],
            "infrastructure": [
                [
                    "official messages coming from Instagram"
                ]
            ],
            "victim": []
        }
    },
    "bleeping-115": {
        "doc": "Mastercard disclosed a data breach to the German and Belgian Data Protection Authorities (DPA) involving customer data from the company's Priceless Specials loyalty program.\n The data was made available on the Internet, with customers' names, payment card numbers, email addresses, home addresses, phone numbers, gender, and dates of birth being included in the leaked info.\n Mastercard says that \"the incident is limited to the Specials program\" and that the only payment card information leaked were the numbers of payment cards.\n After the data leak was discovered, Mastercard suspended the German Priceless Specials and took down its website, leaving up only a message saying that \"This issue has no connection to MasterCard's payment network.\"\n\n \"We have received a lot of questions and complaints since the announcement of this incident, we want to reassure users: we have contacted MasterCard in order to get additional information, and are following this case closely together with the Hessian data protection authority and all the other possible concerned authorities,\" says David Stevens, Chairman of the Belgian Data Protection Authority.\n Breach discovered after data was leaked\nThe breach was discovered after the loyalty program data was released on the Internet on August 19 says Mastercard.\n",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [
                [
                    "email addresses"
                ],
                [
                    "phone numbers"
                ],
                [
                    "home addresses"
                ],
                [
                    "payment card numbers",
                    "payment card information"
                ],
                [
                    "website"
                ],
                [
                    "MasterCard's payment network"
                ]
            ],
            "victim": [
                [
                    "Mastercard",
                    "Mastercard",
                    "Mastercard",
                    "MasterCard",
                    "MasterCard",
                    "Mastercard"
                ]
            ]
        }
    },
    "bleeping-116": {
        "doc": "Microsoft says that Bluetooth speakers will stop connecting to devices running Windows 10, version 1903 after installing the KB4505903 cumulative update released on July 26, 2019.\n Besides the Bluetooth speakers no longer working properly, users will also notice a Microsoft Bluetooth A2dp Source entry under the Sound, video and game controllers node displaying a yellow exclamation mark icon in Device Manager.\n This hints at the device being impacted by some issue related to either missing drivers or the driver not being installed correctly.\n After KB4505903 is installed on a Windows computer with an internal speaker installed, users will experience one of the following issues says Microsoft's support article:\n\n • A Bluetooth speaker can’t connect to the computer.\n • A Bluetooth speaker can connect to the computer.",
        "roles": {
            "adversary": [],
            "capability": [],
            "infrastructure": [],
            "victim": []
        }
    }
}